EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c

//*****************************************************************************
//
// comproc.c - Example for reading data from and writing data to the UART in
//               an interrupt driven fashion.
//
// Copyright (c) 2005-2009 Luminary Micro, Inc.  All rights reserved.
// Software License Agreement
// 
// Luminary Micro, Inc. (LMI) is supplying this software for use solely and
// exclusively on LMI's microcontroller products.
// 
// The software is owned by LMI and/or its suppliers, and is protected under
// applicable copyright laws.  All rights are reserved.  You may not combine
// this software with "viral" open-source software in order to form a larger
// program.  Any use in violation of the foregoing restrictions may subject
// the user to criminal sanctions under applicable laws, as well as to civil
// liability for the breach of the terms and conditions of this license.
// 
// THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
// OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
// LMI SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
// CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 4201 of the EK-LM3S811 Firmware Package.
//
//*****************************************************************************
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <ctype.h>
#include <math.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/timer.h"
#include "utils/uartstdio.h"
#include "driverlib/i2c.h"
#include "driverlib/interrupt.h"
#include "comproc.h"
#include "SysTick.h"
#include "Interpret.h"
#include "Interpret.h"
#include "modeid.h"
#include "globals.h"
#include "reg.h"
#include "led.h"
#include "uart_echo.h"
#include "A3906.h"
#include "rmb20d01.h"
#include "ITG3200.h"
#include "bma180.h"
#include "encoder.h"

//*****************************************************************************
//
// The value that is to be modified ctrl
//
//*****************************************************************************
ctrl_type ctrl = {0};

//*****************************************************************************
//
// The value that is to be modified
//
//*****************************************************************************
unsigned short DMCmode = INITIALIZATION_UNIT;

char status_shutter[9] ={ 0x00, 0xA5, 0x90, 0x20, 0x20, 0x20,0x20, 0x20, 0x68};
char set_temperature[8] = { 0xA4, 0x90, 0x2C, 0x10, 0x17, 0x10,  0x00, 0x50};		
char close_shutter[8] = { 0xA4, 0x90, 0x17, 0x10, 0x00, 0x10,  0x00, 0x50}; 		
char open_shutter[8] =	{ 0xA4, 0x90, 0x17, 0x10, 0x01, 0x10,  0x00, 0x50}; 

unsigned long lasttm;


static BYTE Freeze_Unfreeze = 0x0;
BYTE Stabilize_status = 0x0;

ComProcBuffer cpib[2]; 

extern unsigned long t_ulFlags;
extern ctrl_type ctrl;
extern char  *BCVersion;
extern float e_pos_roll;
extern float e_pos_pitch;

extern char  *BBVersion;
extern float Phic,Thetac;
extern float Ax,Ay,Az,g,Axm,Aym,Azm;
extern unsigned dcycle[2]; 	  // current duty cycle

Frm_Avg_Params	m_Frm_Avg_Params;
NUC_Params 		m_NUC_Params;
ARC_Params 		m_ARC_Params;
ALG_Params 		m_ALG_Params;
CIC_Params 		m_CIC_Params;
DRC_Params 		m_DRC_Params;
Zoom_Flip 		m_Zoom_Flip;
TEC_Params 		m_TEC_Params;

unsigned char message[2][COM_PROC_BUF_LEN]; // receiver message buffer
unsigned char BbTxBuffer[TX_MSG_SIZE];
LabelCmd LabelCmdMsg[MAX_LABEL_LENGTH];

typedef WORD (* ModeType)(WORD);

const ModeType ModeVec[]  =	
{
    Download_Engine_Version,    // DOWNLOAD_VERSION 		0x00
	Upload_Engine_Version,		// DOWNLOAD_VERSION 		0x01       
    OnlineState,		  		// ONLINE_STATE (stop)		0x02  
    Upload_Black_Hot,      		//  BLACK_HOT           		0x03   
    Upload_White_Hot,      		//  WHITE_HOT          		0x04
    Upload_General_Parameters,	// UPLOAD_G_PARAM    	 	0x05	
    NullMode,					// 			         		0x06 
    Open_Close_Shutter,			// OPEN_CLODE_SHUTTER		0x07
    Shutter_Read_Status,		// SHUTTER_READ_STATUS 	0x08
    Shutter_Write_Status,		// SHUTTER_WRITE_STATUS 	0x09
    Enabled_ARC,          		// ENABLED_ARC 			0x0A   
    Disabled_ARC,          		// DISABLED_ARC    		0x0B
    Enabled_CIC,          		// ENABLED_CIC  			0x0C
    Disabled_CIC,     			// DISABLED_CIC			0x0D
    Update_2_P,					// UPDATE2_P				0x0E   
    NullMode,     				//                        			0x0F  
    OfflineState,	  			// OFFLINE_STATE (stop)		0x10
    Freeze_Unfreeze_Video,		// FREEZE_UNFREEZE		0x11
    Upload_V_Flip_Enable,		// UPDATE_V_FLIP			0x12
    Upload_V_Flip_Disable,		// UPDATE_V_FLIP_D		0x13    
    Upload_H_Flip_Enable,		// UPDATE_H_FLIP			0x14
    Upload_H_Flip_Disable,		// UPDATE_H_FLIP_D		0x15  
    Upload_ZoomX2,				// UPDATE_ZOOMX2			0x16
    Upload_ZoomX4,				// UPDATE_ZOOMX4			0x17 
    Disable_Zoom,				// UPDATE_DISABLE_ZOOM	0x18
    Upload_Zoom_Position,		// UPDATE_ZOOM_FLIP		0x19    
    Tec_Read_Handler,			// UPDATE_ZOOM_FLIP		0x1A    
	InitializationUnit,			// INITIALIZATION_UNIT		0x1B
	InitializationUnit,			// INITIALIZATION_UNIT		0x1C
	InitializationUnit,			// INITIALIZATION_UNIT		0x1D	
	InitializationUnit,			// INITIALIZATION_UNIT		0x1E
	Set_Text_Label_Command,		// SET_LABEL_COMMAND		0x1F
	On_Off_Stabilize,			// ON_OFF_STABILIZE		0x20
	RefreshNUCDataCommand,		// REFRESH_NUC			0x21
	NullMode,					//						0x22
	NullMode,					//						0x23	
	NullMode,					//						0x24		
	NullMode,					//						0x25			
	NullMode,					//						0x26
    InitializationUnit			// INITIALIZATION_UNIT		0x27
};

#define MODE_NUM (sizeof(ModeVec) / sizeof(ModeType))

void init_ctrl(void)
{

  ctrl.time[MAIN] = 0;
  ctrl.time[TIME_ZOOM] = 0;
  
  ctrl.time[ONLINE] = g_ulTickCount;  
  ctrl.time[MES_TIME] = g_ulTickCount; 
  ctrl.time[WHITE_BLACK] = g_ulTickCount;
  ctrl.time[TIME_STABILIZ] = g_ulTickCount;
  ctrl.time[TIME_STOW] = g_ulTickCount;
  ctrl.time[TIME_PILOT] = g_ulTickCount;
  ctrl.time[TIME_RATE] = g_ulTickCount;
  ctrl.time[TIME_BH] = g_ulTickCount;
  ctrl.time[TIME_WH] = g_ulTickCount;
  ctrl.time[TEXT_LABEL]= g_ulTickCount;
  ctrl.time[TEXT_LABEL1]= g_ulTickCount;
  ctrl.time[TIME_NUC] = g_ulTickCount;

