EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
  ctrl.state[ONLINE] = 0;
  ctrl.state[UPDATE_2_P] = DISABLED_CIC_2_P;
  ctrl.state[ACT_4] = SET_TEMPERATURE;
  ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL; 				  
  ctrl.state[TEXT_LABEL1] = HIDE_SHOW_LABEL; 				      
  ctrl.state[TIME_BH] = BH_SENT_MESSAGE;
  ctrl.state[TIME_WH] = WH_SENT_MESSAGE;
  ctrl.state[TIME_ZOOM2] = Z2_SENT_MESSAGE;
  ctrl.state[TIME_ZOOM4] = Z4_SENT_MESSAGE;  
  ctrl.state[TIME_DIS] = DIS_SENT_MESSAGE;  
  ctrl.state[TIME_NUC] = REFRESH_NUC_CMD;
  
  //ctrl.main_count = 0;
  ctrl.try[ACT_11]= 0;
  ctrl.try[OFFLINE]= 0;
  ctrl.try[ONLINE] = 0;
  ctrl.try[TIME_ZOOM2] = 0;
  ctrl.try[TIME_ZOOM4] = 0;  
  ctrl.try[TIME_DIS] = 0;  

}


void cpReset(unsigned char cid)
{
   cpib[cid].checksum = 0;
   cpib[cid].idx= 0;
   cpib[cid].len=0;
   cpib[cid].state = 0;
   cpib[cid].ready = 0;
   cpib[cid].mresp = 0;
   cpib[cid].bufidx = 0;
   cpib[cid].crc16 = 0;
   message[cid][MSG_CMD_MSB] = 0;
   message[cid][MSG_CMD_LSB] = 0;
}

void Init_m_DRC_Params(void)
{

	m_DRC_Params.Op_Type=0;					//	2 Byte
	m_DRC_Params.DRC_Type = DRC_TYPE_CLHE;	//	2 Byte
	m_DRC_Params.Rows = IMAGE_HIGHT;		//	2 Byte
	m_DRC_Params.Columns = IMAGE_WIDTH;		//	2 Byte
 	m_DRC_Params.Net_Image.top = 0x1;
	m_DRC_Params.Net_Image.left = NET_IMAGE_START;
	m_DRC_Params.Net_Image.bottom = NUM_OF_ROWS-1;
	m_DRC_Params.Net_Image.right = NET_IMAGE_END-1;
	m_DRC_Params.Hist_Cut_Off = 0x93;		//	2 Byte	
	m_DRC_Params.Hist_Cut_Off_Frm = 0;		//	2 Byte		
	m_DRC_Params.Polarity = B_HOT_POLARITY;	//	1 Byte
	m_DRC_Params.Digital_Video = 0;			//    1 byte
	m_DRC_Params.Hist_Comb_Param =	0;		//	2 Byte	
	m_DRC_Params.DRC_Alg_Type_Param = 0x14;	//    4 byte
	m_DRC_Params.LUT_Update_freq =	  0x0A;	//	2 Byte
	
	#ifdef VERSION_1_3
	m_DRC_Params.gain_minimum_input = 0;	//	2 Byte
	m_DRC_Params.gain_maximum_input = 0x3FFF; //	2 Byte
	m_DRC_Params.gain_minimum_output = 0x10; //	1 Byte
	m_DRC_Params.gain_maximum_output= 0xEB;	//	1 Byte
	#endif

}


void Init_m_Zoom_Flip(void)
{

	/* see definitions above */
	m_Zoom_Flip.byte1 = 0x0;
	m_Zoom_Flip.byte2 = 0x10;
	m_Zoom_Flip.columns = IMAGE_WIDTH;
	m_Zoom_Flip.rows = IMAGE_HIGHT;
	m_Zoom_Flip.center_x = 320;
	m_Zoom_Flip.center_y = 200;
}

void Init_m_CIC_Params(void)
{

	/*  CIC  params  */
	m_CIC_Params.Op_Type = 0;
	m_CIC_Params.Rows = IMAGE_HIGHT;
	m_CIC_Params.Columns = IMAGE_WIDTH;
	
	m_CIC_Params.Net_Image.top = 1;
	m_CIC_Params.Net_Image.left = 7;
	m_CIC_Params.Net_Image.bottom = NUM_OF_ROWS;
	m_CIC_Params.Net_Image.right = NUM_OF_COLUMNS;

	m_CIC_Params.Frm_ID.Row = 0x0001;
	m_CIC_Params.Frm_ID.Column = 0x0001;
	m_CIC_Params.Frm_ID.Mask = 0;
	m_CIC_Params.Frm_ID.Value = 0;
	
	m_CIC_Params.Case_Ref_Col_1 = CASE_REFERENCE_COLUMN_1;
	m_CIC_Params.Case_Ref_Col_2 = CASE_REFERENCE_COLUMN_2;
	m_CIC_Params.SDC_Mode = 0;
	strcpy(m_CIC_Params.CIC_Filename,"/mnt/config/CIC.bin");
	//m_CIC_Params.CIC_Filename[] = "/mnt/config/CIC.bin";
	
}

void Init_m_ALG_Params(void)
{

	 m_ALG_Params.ALG_NONE = 0x0,		
	 m_ALG_Params.ALG_CDS = 0x0,
	 m_ALG_Params.ALG_CIC = 0x2,
	 m_ALG_Params.ALG_NUC = 0x6,
	 m_ALG_Params.ALG_BPR = 0x3,
	 m_ALG_Params.ALG_DRC = 0x5,
	 m_ALG_Params.ALG_FRM = 0x4,
	 m_ALG_Params.ALG_SGF = 0x0;
	 m_ALG_Params.Op_Type = 0;
}

void Init_m_ARC_Params(void)
{
	 m_ARC_Params.Enable = 0x01;
	 m_ARC_Params.Threshold_Fine=ARC_THRESHOLD_FINE_DEFAULT;
	 m_ARC_Params.Threshold_Coarse=ARC_THRESHOLD_COARSE_DEFAULT;
	 m_ARC_Params.Timeout_Trigger =ARC_TIME_TRIGGER;
}


	
void Init_m_NUC_Params(void)
{

	/*  NUC  params  */
	m_NUC_Params.Op_Type = 0;
	m_NUC_Params.Rows = IMAGE_HIGHT;
	m_NUC_Params.Columns = IMAGE_WIDTH;
	
	m_NUC_Params.Net_Image.top = 0;
	m_NUC_Params.Net_Image.left = NET_IMAGE_START;
	m_NUC_Params.Net_Image.bottom = NUM_OF_ROWS-1;
	m_NUC_Params.Net_Image.right = NET_IMAGE_END;
	
	m_NUC_Params.Frm_ID.Row = 0x0001;
	m_NUC_Params.Frm_ID.Column = 0x0001;
	m_NUC_Params.Frm_ID.Mask = 0x0000;
	m_NUC_Params.Frm_ID.Value = 0x0000;
	
	m_NUC_Params.Auxilliary_Col = NUM_OF_AUX_COLUMNS;
	m_NUC_Params.NUC_Type = 0;
	strcpy(m_NUC_Params.NUC_Filename,"/mnt/config/NUC.bin");
	//m_NUC_Params.NUC_Filename[] = "/mnt/config/NUC.bin";	// 26-281	
};


void Init_m_Frm_Avg_Params(void)
{
	/*	Frm_Avg  params  */
	m_Frm_Avg_Params.Op_Type = 0;
	m_Frm_Avg_Params.Rows = IMAGE_WIDTH;
	m_Frm_Avg_Params.Columns = IMAGE_HIGHT;
	m_Frm_Avg_Params.Buffer_ID = 0;
	m_Frm_Avg_Params.Num_Of_Frames = 0x20;
	strcpy(m_Frm_Avg_Params.Frm_Avg_Filename,"/mnt/config/Avg.bin");
	//m_Frm_Avg_Params.Frm_Avg_Filename[] = "/mnt/config/Avg.bin";	
}

void Init_LABEL_Roll_Pitch(int Visibility)
{
		unsigned char id = 0;		
		unsigned char idx = 0;
		
		memset(&LabelCmdMsg,0,sizeof(LabelCmdMsg));

		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 0
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0] 		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 180;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 10;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));			
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));		
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],0x10,sizeof(unsigned char));		
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));		
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));		
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"STOW");	// 0
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;

		id++; // 1
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id; 	// 1
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 7;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 100;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"PILOT");		// 1
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;

		id++;	// 2
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 2
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 30;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 30;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],0x10,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"RATE");		// 2
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;

