EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
		id++;	// 3
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 3
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 30;//250;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 20;//10;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],10,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;


		id++;	// 4
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 4
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 35;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 250;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;

		id++;	// 5
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 5
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 100;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 250;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;

		id++;	// 6
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 6
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 56;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 250;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;	

		id++;	// 7
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 7
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 125;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 250;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;
		

		id++;	// 8
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 8
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 0;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 88;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

		id++;	// 9
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 9
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 5;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 100;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

		id++;	// 10
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 10
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 110;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

