EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
		id++;	// 11
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 11
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 120;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;

		id++;	// 12
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 12
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 130;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

		id++;	//13
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 13
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 140;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

		id++;	// 14
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 14
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 150;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

		id++;	// 15
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 15
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 160;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

		id++;	// 16
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 16
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 5;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 170;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;		

		id++;	// 17
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 17
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 180;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;				

