EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
		id++;	// 18
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 18
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 190;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;				

		id++;	// 19
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 19
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 200;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;				

		id++;	// 20
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 20
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 210;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;				


		id++;	// 21
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 21
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 220;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;				

		id++;	// 22
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 22
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 24;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 230;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;


		id++;	// 23
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 23
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 5;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 240;	// Y
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;	

		id++;	// 24
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 24
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 56;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 14;	// Y
		LabelCmdMsg[idx].Position_id_X_Y[4]		= 1;	// Y		
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;


		id++;	// 25
		idx++;
		LabelCmdMsg[idx].Label_id_Visibility[0]		= id;	// 25
		LabelCmdMsg[idx].Label_id_Visibility[1]		= Visibility;
		LabelCmdMsg[idx].Position_id_X_Y[0]		= id;
		LabelCmdMsg[idx].Position_id_X_Y[1]		= 125;	// X
		LabelCmdMsg[idx].Position_id_X_Y[3]		= 14;	// Y
		LabelCmdMsg[idx].Position_id_X_Y[4]		= 1;	// Y		
		memcpy(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[0],(unsigned char *)&id,sizeof(unsigned char));	
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[3],14,sizeof(unsigned char));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));
		memset(&LabelCmdMsg[idx].Style_id_Color_Size_BackGro_text[6],1,sizeof(unsigned char));
		LabelCmdMsg[idx].Text_id			= id;
		//strcpy(LabelCmdMsg[idx].Text,"CG    ");		//	3
		//LabelCmdMsg[idx].Text[strlen(LabelCmdMsg[idx].Text)] = 0;	

		
