EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
}

 
/*
 * FUNCTION:  COM1 OmapMessageLoop - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
int
OmapMessageLoop(unsigned long ulBase,unsigned char cid)
{
   char ch;
   //int i = 0;
   unsigned short Checksum = 0;
   
   /*
    * If there is byte in comm. stream 
    */
   do 
   {
	  //
	  // Prompt for text to be entered.
	  //
   
      //ch = UARTCharGet(ulBase);
      ch = UARTCharGetNonBlocking(ulBase);	  	  
	  
      message[cid][cpib[cid].idx++] = ch;

     /*
      * Overflow check
      */ 
      if (cpib[cid].idx >= COM_PROC_BUF_LEN)
      {
         cpReset(cid);
         return cpib[cid].ready; 
      }

     /*
      * Switch for state of tge message protocol processing
      */
      switch (cpib[cid].state)
      {
          case MSG_FLAG: // Locks for a FLAG character
          
             if (ch == HEADER_SYNC)
             {             				 				 
                 if (cpib[cid].idx > 1u)
                 {
                    message[cid][0] = ch;
                    cpib[cid].idx = 1u;
                 }
                 cpib[cid].state++; // Gos to next state
             }
             
             break;

          case MSG_CMD_LSB: // Receive the message comman
             cpib[cid].state++;
             
             break;

          case MSG_CMD_MSB: // Receive the message comman
             cpib[cid].state++;
             
             break;

          case MSG_LEN_LSB: // Receive message length (2 bytes) 
          
             cpib[cid].len = (unsigned short)ch;
             cpib[cid].state++;
			         
			 
             break;

          case MSG_LEN_MSB:
             cpib[cid].len |= (unsigned short)ch << 8;
             cpib[cid].state++;
			 cpib[cid].len += 6u;
			
             break;
 
         case MSG_DATA:

             if (cpib[cid].idx >= (cpib[cid].len)) // Counts the received bytes
             {
			   cpib[cid].len -= 6u;             
               cpib[cid].idx = 0;
               cpib[cid].state = 0;
			   cpib[cid].checksum = 0;
			   Checksum = 0;

               /*
                		* Checks Checksum
                		*/
               Checksum = CalculateChecksumMsg(COM1,&message[cid][0],cpib[cid].len+MSG_DATA);	

			   
               //for(i=0;i<cpib[cid].len-1;i++)
			   	//Checksum(cid, message[cid][i]);
			   
			   //cpib[cid].checksum %= 256;
			   //cpib[cid].checksum = (unsigned char)((~cpib[cid].checksum) + 1);

				
               if (Checksum == message[cid][cpib[cid].len+MSG_DATA])
               {		  
               
				  cpib[cid].ready = (unsigned short) message[cid][MSG_CMD_LSB];               
                  cpib[cid].ready |= (unsigned short) message[cid][MSG_CMD_MSB]<<8;

               }
               else
               {   
                  cpReset(COM1);
                  cpib[cid].ready = 0;
                  cpib[cid].len = 0;
               }
             }             
             break;

          default:
             cpib[cid].state = 0;
             cpib[cid].idx = 0;
             cpib[cid].ready = 0;
             break;
       }
   } while (UARTCharsAvail(UART1_BASE));

   return cpib[cid].ready;
}


/*
 * FUNCTION:  COM0 ContropMessageLoop - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
int
ContropMessageLoop(unsigned long ulBase,unsigned char cid)
{
   char ch;
   int i = 0;	
   /*
    * If there is byte in comm. stream 
    */
   do 
   {
   
      //ch = UARTCharGet(ulBase);
	  ch = UARTCharGetNonBlocking(ulBase);

      message[cid][cpib[cid].idx++] = ch;
 
	  
     /*
      * Overflow check
      */ 
      if (cpib[cid].idx >= COM_PROC_BUF_LEN)
      {
         cpReset(cid);
         return cpib[cid].ready;
      }

     /*
      * Switch for state of tge message protocol processing
      */
      switch (cpib[cid].state)
      {
          case BCP_MSG_FLAG: // Locks for a FLAG character
          
             if (ch == BCP_HEADER_1_SYNC)
             {
				 
	             if (cpib[cid].idx > 1u)
                 {
                    message[cid][0] = ch;
                    cpib[cid].idx = 1u;
                 }
                 cpib[cid].state++; // Gos to next state
             }
             
             break;

          case BCP_HEADER_1: // Receive the message comman

             if (ch == BCP_HEADER_2_SYNC)    
             	cpib[cid].state++;
			 else
				 cpReset(COM1);
			 
             break;

          case BCP_HEADER_2: // Receive the message comman

             if (ch == BCP_HEADER_3_SYNC)
             {
          
             	cpib[cid].state++;
				cpib[cid].len = 20;
				
             }             
			 else
				 cpReset(COM1);

			 
             break;

 
         case BCP_MSG_DATA:
		 	
             if (cpib[cid].idx >= cpib[cid].len) // Counts the received bytes
             {
               cpib[cid].idx = 0;
               cpib[cid].state = 0;
			   cpib[cid].checksum = 0;
			   
               /*
                		* Checks Checksum
                		*/
               for(i=0;i<18;i++)
			   	Checksum(cid, message[cid][i]);
			   
			   cpib[cid].checksum %= 256;
			   	
               if (cpib[cid].checksum == message[cid][19])
               {
				  cpib[cid].ready = 1;			  
				  InterpretCmd();
				  if ((WORD)(g_ulTickCount - ctrl.time[MES_TIME]) >= (WORD)1000) //-- every 1 sec
				  {   
						ctrl.time[MES_TIME] = g_ulTickCount;	
						BBLedToggle();
				  }   
				  
                  //cpib[cid].len -= 2u;
             //   return cpib[cid].ready;

               }
               else
               {   
                  cpib[cid].ready = CHECKSUM_ERROR_DETECT;
                  cpib[cid].len = 0;
				  //BBLedToggle();
				  
               }
             }             
             break;

          default:
             cpib[cid].state = 0;
             cpib[cid].idx = 0;
             cpib[cid].ready = 0;
             break;
       }
   } while (UARTCharsAvail(UART0_BASE));

