EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
   return cpib[cid].ready;
}


/*!=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-  FUNCTION  HEADER  -=-=-=-=-=-=-=-=-=
 
FUNCTION:  cpPutMessage   
 
INTERNAL DESCRIPTION: preper the TX msg for transmit
 			  			  
----------------------------------------------------------------------------!*/

void cpPutMessage(unsigned long ulBase,unsigned short cmd,unsigned short data_len,unsigned char *msg)
{
	//unsigned char chacksum = 0;
	unsigned short total_len,headerDataLen;
	BB_TXRX_S *pBbMsg=(BB_TXRX_S *)BbTxBuffer;

	headerDataLen=(BIRD384_HEADER_LEN+data_len);
	total_len=(headerDataLen+TAILER_SIZE);

	pBbMsg->sync=0xAA;
	memcpy(pBbMsg->command,(unsigned short *)&cmd,sizeof(unsigned short));	
	memcpy(pBbMsg->msg_len,(unsigned short *)&data_len,sizeof(unsigned short));
	memcpy(pBbMsg->buffer,msg,data_len);
	pBbMsg->buffer[data_len]=CalculateChecksumMsg(COM1,(unsigned char *)pBbMsg,(data_len+BIRD384_HEADER_LEN));
 	UART1Send(BbTxBuffer, total_len);  		
}


/*
 * FUNCTION: cpMessageReady - Return Message Ready flag
 */
unsigned short cpMessageReady(unsigned char cid)
{
     return cpib[cid].ready;
}

/*
 * FUNCTION: cpGetMessageCommand - Returns received message command
 * and zero Message Ready flag
 */
unsigned short cpGetMessageCommand(unsigned char cid)
{
   unsigned short m = cpib[cid].ready;
   cpib[cid].ready = 0;    
   return m;
}

/*
 * FUNCTION: cpGetMessage - Returns received message
 */
unsigned char * cpGetMessage(unsigned char cid)
{
   return message[cid];
}

/*
 * FUNCTION: cpGetMessageData - Returns received message data 
 */ 
unsigned char * cpGetMessageData(unsigned char cid,unsigned short mgs_data)
{
   return (message[cid] + MSG_DATA + mgs_data); // ne virno !!!
}

/*
 * FUNCTION: cpGetMessageDataLen - Returns received message data length
 */
unsigned short cpGetMessageDataLen(unsigned char cid)
{
   return (cpib[cid].len - 6u);
}


/*
 * FUNCTION: Checksum - Perform Checksum calculation on input data
 *           and updates cpib[cid].checksum var.
 * PARAM: data - received data
 */
void Checksum(unsigned char cid, unsigned char data)
{

   cpib[cid].checksum+=data;
 
}


double GetCaseTemperature(void)
{
   return m_TEC_Params.Case_tem;
}


/*
 * FUNCTION: Checksum - Perform Checksum calculation on input data
 *           and updates cpib[cid].checksum var.
 * PARAM: data - received data
 */
unsigned char CalculateChecksumMsg(unsigned char cid, unsigned char *msg,unsigned short data_len)
{

  unsigned short i=0;
  int  checksum = 0; // Checksum message value

   for(i=0;i<data_len;i++)
   	checksum+=msg[i];
   checksum = (unsigned char)((~checksum) + 1);

   return checksum;   
}

void putDMCmode(WORD mode)
{
	DMCmode=mode;
}

unsigned short GetDMCmode(void)
{
	return DMCmode;
}


void MainModeLoop(void)
{

	if (DMCmode < MODE_NUM)
	{
		 DMCmode = ModeVec[DMCmode](DMCmode);
	}
	else
	{
		 DMCmode = ONLINE_STATE;
	}
	
}

// stay on this tempoary mode
WORD NullMode(WORD mode)
{
    return mode;
}

WORD ModeExec(WORD mode)
{
   if (mode < MODE_NUM)
       mode  = ModeVec[mode](mode);

   return mode;
}

/*
 * FUNCTION: OnlineState - Super state on ONLINE mode
 */
WORD OnlineState(WORD mode)
{

	  //char zoom;
	  //char zoom;
	  //WORD	 id = 0;
	  //static float k_alt = 34.0f,k_lon = 32.0f;	  
	  float tmpPhic=0,tmpThetac=0;

      if (cpMessageReady(COM1))
      {            
         // Read Comm message
         WORD m = cpGetMessageCommand(COM1);         
         WORD f = GetDMCflag(0xffff);

         if((f && 0x0010) )
         {
            mode = m;
 
         }      
      }
	  #if 1
	  else 
	  if ((WORD)(g_ulTickCount - ctrl.time[ONLINE]) >= (WORD)500) //-- every 1 sec
	  {	  
				
	  			#if 1
				//cAz+=0.01;
			    //tmpPhic = (Phic * RAD2DEG);	  
			    //tmpThetac= (Thetac* RAD2DEG);   	  

			    sprintf(LabelCmdMsg[24].Text,"%.2f",(Phic * RAD2DEG));	   //  9	Roll
			    sprintf(LabelCmdMsg[25].Text,"%.2f",(Thetac* RAD2DEG));	   //  9	Pitch		

				sprintf(LabelCmdMsg[OSD_ROLL_DEG].Text,"%.1f",Motor[ROLL_MOTOR].aangle);	   //  9	Roll
			    sprintf(LabelCmdMsg[OSD_PITCH_DEG].Text,"%.1f",Motor[PITCH_MOTOR].aangle);	   //  9	Pitch		

			    //sprintf(LabelCmdMsg[OSD_VERSION_ID].Text,"EncP:%.2f  EncR:%.2f",Motor[PITCH_MOTOR].aangle,Motor[ROLL_MOTOR].aangle);	   //  9					  

				if(MotorPositionError(PITCH_MOTOR) == -1)
					sprintf(LabelCmdMsg[OSD_VERSION_ID].Text,"PITCH ERROR!!!");	   //  9													
				else
				if(MotorPositionError(ROLL_MOTOR) == -1)
					sprintf(LabelCmdMsg[OSD_VERSION_ID].Text,"ROLL ERROR!!!");	   //  9													
				else			    
			    sprintf(LabelCmdMsg[OSD_VERSION_ID].Text,"DirR:%u pwmP:%u  pwmR:%u",mdirection[ROLL_MOTOR],dcycle[PITCH_MOTOR],dcycle[ROLL_MOTOR]);	   //  9					  								
			    //sprintf(LabelCmdMsg[OSD_VERSION_ID].Text,"Tmp:%d pwmP:%u  pwmR:%u",bmaregs[TEMPERATURE],dcycle[PITCH_MOTOR],dcycle[ROLL_MOTOR]);	   //  9					  								
			    
			    //sprintf(LabelCmdMsg[OSD_VERSION_ID].Text,"Axm:%.2f  Aym:%.2f Azm:%.2f g:%.2f",Axm,Aym,Azm,g);	   //  9					  			    
			    LabelCmdMsg[OSD_PITCH_DEG].Text[strlen(LabelCmdMsg[OSD_PITCH_DEG].Text)] = 0; 
				LabelCmdMsg[OSD_ROLL_DEG].Text[strlen(LabelCmdMsg[OSD_ROLL_DEG].Text)] = 0;
			    LabelCmdMsg[OSD_VERSION_ID].Text[strlen(LabelCmdMsg[OSD_VERSION_ID].Text)] = 0;
				LabelCmdMsg[24].Text[strlen(LabelCmdMsg[24].Text)] = 0;
			    LabelCmdMsg[25].Text[strlen(LabelCmdMsg[25].Text)] = 0;
				
			    ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 					  
			    Put_Text_Label(OSD_PITCH_DEG,1);
				
			    ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 					  
			    Put_Text_Label(OSD_ROLL_DEG,1);
				
				ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 
			    Put_Text_Label(OSD_VERSION_ID,1);  

				ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 
			    Put_Text_Label(24,1); 

				ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 
			    Put_Text_Label(25,1); 				
  				#endif
				
				ctrl.time[ONLINE] = g_ulTickCount;	
				BBLedToggle1();
	  }	  
	  #endif
   return mode;
}



	
/*
 * FUNCTION: InitializationUnit - Super state on OFFLINE mode
 */
WORD InitializationUnit(WORD mode)
{
   if ((WORD)(g_ulTickCount - ctrl.time[ONLINE]) >= (WORD)35000) //-- every 1 sec
   {   
       ctrl.time[OFFLINE] = GetSysTickCount();
	   return DOWNLOAD_VERSION;
   }
   else
	  ctrl.time[OFFLINE] = g_ulTickCount;

   return INITIALIZATION_UNIT;   

   
