EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
}


/*
 * FUNCTION: OnlineState - Super state on ONLINE mode
 */
WORD OfflineState(WORD mode)
{


      if (cpMessageReady(COM1))
      {      
      
         // Read Comm message
         WORD m = cpGetMessageCommand(COM1);         

      }
	  else 
	  if ((WORD)(g_ulTickCount - ctrl.time[OFFLINE]) >= (WORD)25000) //-- every 15 sec
	  {	  
				ctrl.time[OFFLINE] = g_ulTickCount;
					mode = DOWNLOAD_VERSION;						
	  }
	  
   return mode;
}


WORD Download_Engine_Version(WORD mode)
{
	
	
	ctrl.ret_mode[ACT_11] = 0xF011;
	cpPutMessage(UART1_BASE,0xF011,0,NULL);
	return UPLOAD_VERSION;

}


WORD Upload_Engine_Version(WORD mode)
{

	WORD n;
	WORD   id = 0;
	WORD i = 4;
	WORD ret = 0;
										
	if (cpMessageReady(COM1))
	{
		n = cpGetMessageCommand(COM1); //tbd
		if (n==ctrl.ret_mode[ACT_11])
		{			
	
			cpReset(COM1);		
			ctrl.try[ACT_11] = 0;		
			
			sprintf(LabelCmdMsg[1].Text,"<<"); 	//	9					
			LabelCmdMsg[1].Text[strlen(LabelCmdMsg[1].Text)] = 0;					
			Set_LABEL_Visibility(OSD_ZOOM_ID,1);

			if(GetDMCflag(DMC_BLACK_HOT))
			{
				strcpy(LabelCmdMsg[2].Text,"B-W");
				LabelCmdMsg[2].Text[strlen(LabelCmdMsg[2].Text)] = 0;										
				Set_LABEL_Visibility(OSD_BLACK_WHITE_HOT_ID,1);
			
			}
			else
			{
				strcpy(LabelCmdMsg[2].Text,"W-H");
				LabelCmdMsg[2].Text[strlen(LabelCmdMsg[2].Text)] = 0;										
				Set_LABEL_Visibility(OSD_BLACK_WHITE_HOT_ID,1);			
			}

			sprintf(LabelCmdMsg[OSD_VERSION_ID].Text,"%s","Paylod Bit"); 	//	9					
			LabelCmdMsg[OSD_VERSION_ID].Text[strlen(LabelCmdMsg[OSD_VERSION_ID].Text)] = 0;					
			Set_LABEL_Visibility(OSD_VERSION_ID,1);
			
			if (GetDMCflag(DMC_STOW))
			{
				strcpy(LabelCmdMsg[0].Text,"STOW");
				LabelCmdMsg[0].Text[strlen(LabelCmdMsg[0].Text)] = 0;										
				Set_LABEL_Visibility(OSD_MODE_ID,1);
			
			}
			else
			if (GetDMCflag(DMC_PILOT_WINDOW))
			{
				strcpy(LabelCmdMsg[0].Text,"PILOT");
				LabelCmdMsg[0].Text[strlen(LabelCmdMsg[0].Text)] = 0;										
				Set_LABEL_Visibility(OSD_MODE_ID,1);
			
			}
			else
			{
				strcpy(LabelCmdMsg[0].Text,"RATE");
				LabelCmdMsg[0].Text[strlen(LabelCmdMsg[0].Text)] = 0;										
				Set_LABEL_Visibility(OSD_MODE_ID,1);			
			}

			strcpy(LabelCmdMsg[i].Text,"Roll:");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);
			i++;

			strcpy(LabelCmdMsg[i].Text,"Pitch:");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);
			i++;

			strcpy(LabelCmdMsg[i].Text,"0.0");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);
			i++;

			strcpy(LabelCmdMsg[i].Text,"0.0:");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);
			i++;

			// i ==8 
			strcpy(LabelCmdMsg[i].Text,"ZOOM");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);
			i++;

			strcpy(LabelCmdMsg[i].Text,"Zx0-|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);
			i++;

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);
			i++;
			
			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;
			
			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;
			
			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;

			strcpy(LabelCmdMsg[i].Text,"Zx2-|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;			

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;	
			
			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);			
			i++;

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);				
			i++;

			strcpy(LabelCmdMsg[i].Text,"|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);				
			i++;

			strcpy(LabelCmdMsg[i].Text,"Zx4-|");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);	
			i++;
			
			strcpy(LabelCmdMsg[i].Text,"0.0");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);	
			i++;
			
			strcpy(LabelCmdMsg[i].Text,"1.1");
			LabelCmdMsg[i].Text[strlen(LabelCmdMsg[i].Text)] = 0;										
			Set_LABEL_Visibility(i,1);	
			i++;

			
			//ctrl.state[TEXT_LABEL1] = HIDE_SHOW_LABEL;

			//for(id=0;id<MAX_LABEL_LENGTH;id++)
				//Set_Text_Label(id,1);

			//ctrl.state[TEXT_LABEL1] = HIDE_SHOW_LABEL;

			//for(id=0;id<MAX_LABEL_LENGTH;id++)
				//Set_Text_Label(id,1);

			ctrl.state[TEXT_LABEL1] = HIDE_SHOW_LABEL;

			for(id=0;id<MAX_LABEL_LENGTH;id++)
			{
				if(Set_Text_Label(id,1) == 0)		
					id = 0;
			}
			
			cpReset(COM1);
			SetDMCflag(DMC_ENGINE_CONNECT,DMC_ENGINE_CONNECT);
			mode = ONLINE_STATE;
		
		}
		else
			cpReset(COM1);
		  
	}
	else
	if ((WORD)(GetSysTickCount() - ctrl.time[ACT_11]) >= (WORD)5000) //-- every 3 sec
	{			
		  cpPutMessage(UART1_BASE,0xF011,0,NULL);	
		  ctrl.time[ACT_11]	= g_ulTickCount;
		  
		  if(ctrl.try[ACT_11]++ > 3)
		  {		  
			  ctrl.time[ACT_11]	= g_ulTickCount;		  
			  ctrl.time[ONLINE] = g_ulTickCount;
			  ctrl.try[ACT_11] = 0;									  
			  cpReset(COM1);				 
			  mode = INITIALIZATION_UNIT;			  
		  }
	}					

	return mode;


