EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
}


WORD Upload_General_Parameters(WORD mode)
{
	
	ctrl.ret_mode[TRAN_16] = 0xF018;
	//ctrl.next_mode = ONLINE_STATE;		
	ctrl.next_mode[TRAN_16] = ONLINE_STATE;	
	cpPutMessage(UART1_BASE,0xF018,sizeof(m_ALG_Params),(unsigned char *)&m_ALG_Params);

	return ONLINE_STATE;

}

WORD Disabled_CIC(WORD mode)
{
	m_ALG_Params.ALG_CIC = 0;
	return UPLOAD_G_PARAM;

}

WORD Enabled_CIC(WORD mode)
{
	m_ALG_Params.ALG_CIC = 0x2;
	return UPLOAD_G_PARAM;

}

WORD Disabled_ARC(WORD mode)
{
	m_ARC_Params.Enable = 0x00;
	ctrl.ret_mode[TRAN_ARC] = 0xF020;
	cpPutMessage(UART1_BASE,0xF020,sizeof(m_ARC_Params),(unsigned char *)&m_ARC_Params);

	return ONLINE_STATE;

}

WORD Enabled_ARC(WORD mode)
{
	m_ARC_Params.Enable = 0x01;
	ctrl.ret_mode[TRAN_ARC] = 0xF020;
	
	cpPutMessage(UART1_BASE,0xF020,sizeof(m_ARC_Params),(unsigned char *)&m_ARC_Params);

	return ONLINE_STATE;

}


WORD Shutter_Read_Status(WORD mode)
{
	char arr[9] ={ 0x00, 0xA5, 0x90, 0x20, 0x20, 0x20,0x20, 0x20, 0x68};

	ctrl.ret_mode[TRAN_16] = 0xFD05;
	//ctrl.next_mode = SHUTTER_WRITE_STATUS;
	ctrl.next_mode[TRAN_16] = SHUTTER_WRITE_STATUS;
		
	cpPutMessage(UART1_BASE,0xFD05,sizeof(arr),(unsigned char *)&arr);

	return ONLINE_STATE;

}

WORD Shutter_Write_Status(WORD mode)
{

	WORD n;

	if (cpMessageReady(COM1))
	{
	   n = cpGetMessageCommand(COM1); //tbd
	   if (n==ctrl.ret_mode[TRAN_16])
	   {
	   	 if(*(cpGetMessageData(COM1,1)) == 0x01)
		  mode = ONLINE_STATE;
		 	
	   }
	}

	return mode;

}

WORD Upload_Black_Hot(WORD mode)
{

	//int i=0;
	WORD n;
	unsigned char Polarity = 0x00;

	/*
	 * Switch for state of tge message protocol processing
	 */
	
	switch (ctrl.state[TIME_BH])
	{
	
		  case BH_SENT_MESSAGE: // Locks for a FLAG character

			   memset(&LabelCmdMsg[2].Style_id_Color_Size_BackGro_text[1],0xFF,sizeof(unsigned short));
			   memset(&LabelCmdMsg[2].Style_id_Color_Size_BackGro_text[3],0x10,sizeof(unsigned char));
			   memset(&LabelCmdMsg[2].Style_id_Color_Size_BackGro_text[4],0,sizeof(unsigned short));

			   strcpy(LabelCmdMsg[2].Text,"B-H");
			   LabelCmdMsg[2].Text[strlen(LabelCmdMsg[2].Text)] = 0;									   
			   Set_LABEL_Visibility(OSD_BLACK_WHITE_HOT_ID,1);
			   
			   ctrl.ret_mode[TIME_BH] = 0xF201;			   
			   ctrl.next_mode[TIME_BH] = BH_HIDE_SHOW_LABEL;			   
			   ctrl.exit_mode[TIME_BH] = BH_SENT_MESSAGE;
			   ctrl.state[TIME_BH] = BH_WAIT_FOR_MESSAGE_READY;
		
			   #ifdef VERSION_1_3
			   cpPutMessage(UART1_BASE,0xF021,sizeof(m_DRC_Params),(unsigned char *)&m_DRC_Params);
			   #else	  
			   cpPutMessage(UART1_BASE,0xF201,1,(unsigned char *)&Polarity);
			   #endif
			   ctrl.time[TIME_BH] = g_ulTickCount;		   
		
		  break;	
 
			 case BH_HIDE_SHOW_LABEL: // Locks for a FLAG character
  
				  ctrl.ret_mode[TIME_BH] = 0xF050;			  
				  ctrl.next_mode[TIME_BH] = BH_X_LABEL_POSITION;			  
				  ctrl.exit_mode[TIME_BH] = BH_HIDE_SHOW_LABEL;
				  cpPutMessage(UART1_BASE,0xF050,0x2,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Label_id_Visibility[0]);			  
				  ctrl.state[TIME_BH] = BH_WAIT_FOR_MESSAGE_READY;  
				  ctrl.time[TIME_BH] = g_ulTickCount;
  
			 break;
  
			 case BH_X_LABEL_POSITION: // Locks for a FLAG character
			 
				  ctrl.ret_mode[TIME_BH] = 0xF051;
				  ctrl.next_mode[TIME_BH] = BH_LEBEL_TEXT;
				  ctrl.exit_mode[TIME_BH] = BH_X_LABEL_POSITION;
				  cpPutMessage(UART1_BASE,0xF051,0x5,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Position_id_X_Y[0]);			  
				  ctrl.state[TIME_BH] = BH_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_BH] = g_ulTickCount;
				  
			 
			 break;
  
			 case BH_LEBEL_TEXT: // Locks for a FLAG character 			 
			 
				  ctrl.ret_mode[TIME_BH] = 0xF052;
				  ctrl.next_mode[TIME_BH] = BH_STYLE_FORMAT;
				  ctrl.exit_mode[TIME_BH] = BH_LEBEL_TEXT;
				  cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Text)+2,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Text_id);
				  ctrl.state[TIME_BH] = BH_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_BH] = g_ulTickCount;		  
				  
			 
			 break;
  
			 case BH_STYLE_FORMAT: // Locks for a FLAG character
			 
				 ctrl.ret_mode[TIME_BH] = 0xF053;
				 ctrl.next_mode[TIME_BH] = BH_END_LEBEL_CMD;
				 ctrl.exit_mode[TIME_BH] = BH_STYLE_FORMAT;
				 
				 cpPutMessage(UART1_BASE,0xF053,0x7,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Style_id_Color_Size_BackGro_text[0]);
				 ctrl.state[TIME_BH] = BH_WAIT_FOR_MESSAGE_READY;
				 ctrl.time[TIME_BH] = g_ulTickCount;
				 
			 
			 break;
  
			 case BH_END_LEBEL_CMD: // Locks for a FLAG character
			 
				 ctrl.state[TIME_BH] = BH_HIDE_SHOW_LABEL;	  
				 ctrl.time[TIME_BH] = g_ulTickCount;
				 cpReset(1);  
				 SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE); 				 
				 mode = ONLINE_STATE;
			 
			 break;
		
		  case BH_WAIT_FOR_MESSAGE_READY:
		  
			  if (cpMessageReady(COM1))
			  {
				  n = cpGetMessageCommand(COM1); //tbd
				  if (n==ctrl.ret_mode[TIME_BH])
				  {
					   ctrl.state[TIME_BH] = ctrl.next_mode[TIME_BH]; 				   
					   ctrl.time[TIME_BH] = g_ulTickCount;					   
					   cpReset(1);
				  }
				  else
				  {
					  ctrl.state[TIME_BH] = BH_SENT_MESSAGE; 					  
					  ctrl.time[TIME_BH] = g_ulTickCount;					  					  
					  cpReset(1);
					  mode = ONLINE_STATE;
				  }
					
			  } 		 
			  else
			  if ((WORD)(g_ulTickCount - ctrl.time[TIME_BH]) >= (WORD)1000) //-- every 0.5 sec  
			  {
					ctrl.state[TIME_BH] = BH_SENT_MESSAGE;	 
					ctrl.time[TIME_BH] = g_ulTickCount;
					cpReset(1);  
					mode = ONLINE_STATE;					
			  }
		  
		  break;
	
	  default:

					  ctrl.state[TIME_BH] = BH_SENT_MESSAGE; 					  
					  ctrl.time[TIME_BH] = g_ulTickCount;					  					  
					  cpReset(1);
					  mode = ONLINE_STATE;
					  
		 break;
	}

	return mode;

}

WORD Upload_White_Hot(WORD mode)
{

	//int i=0;
	WORD n;	
	unsigned char Polarity = 0x01;

	/*
	 * Switch for state of tge message protocol processing
	 */

	switch (ctrl.state[TIME_WH])
	{
	
			  case WH_SENT_MESSAGE: // Locks for a FLAG character

			   memset(&LabelCmdMsg[2].Style_id_Color_Size_BackGro_text[1],0,sizeof(unsigned short));
			   memset(&LabelCmdMsg[2].Style_id_Color_Size_BackGro_text[3],0x10,sizeof(unsigned char));
			   memset(&LabelCmdMsg[2].Style_id_Color_Size_BackGro_text[4],0xFF,sizeof(unsigned short));

			   strcpy(LabelCmdMsg[2].Text,"W-H");
			   LabelCmdMsg[2].Text[strlen(LabelCmdMsg[2].Text)] = 0;									   
			   Set_LABEL_Visibility(OSD_BLACK_WHITE_HOT_ID,1);
			   
			   ctrl.ret_mode[TIME_WH] = 0xF201; 		   
			   ctrl.next_mode[TIME_WH] = WH_HIDE_SHOW_LABEL; 		   
			   ctrl.exit_mode[TIME_WH] = WH_SENT_MESSAGE;
			   ctrl.state[TIME_WH] = WH_WAIT_FOR_MESSAGE_READY;
			
			   #ifdef VERSION_1_3
				   cpPutMessage(UART1_BASE,0xF016,sizeof(m_DRC_Params),(unsigned char *)&m_DRC_Params);
			   #else	  
				   cpPutMessage(UART1_BASE,0xF201,1,(unsigned char *)&Polarity);
			   #endif
			   ctrl.time[TIME_WH] = g_ulTickCount;		   
				   	
			
			  break;
	
			 case WH_HIDE_SHOW_LABEL: // Locks for a FLAG character
  
