EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
				  ctrl.ret_mode[TIME_WH] = 0xF050;			  
				  ctrl.next_mode[TIME_WH] = WH_X_LABEL_POSITION;			  
				  ctrl.exit_mode[TIME_WH] = WH_HIDE_SHOW_LABEL;
				  cpPutMessage(UART1_BASE,0xF050,0x2,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Label_id_Visibility[0]);			  
				  ctrl.state[TIME_WH] = WH_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_WH] = g_ulTickCount;
  
  
			 break;
  
			 case WH_X_LABEL_POSITION: // Locks for a FLAG character
			 
				  ctrl.ret_mode[TIME_WH] = 0xF051;
				  ctrl.next_mode[TIME_WH] = WH_LEBEL_TEXT;
				  ctrl.exit_mode[TIME_WH] = WH_X_LABEL_POSITION;
				  cpPutMessage(UART1_BASE,0xF051,0x5,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Position_id_X_Y[0]);			  
				  ctrl.state[TIME_WH] = WH_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_WH] = g_ulTickCount;
				  
			 
			 break;
  
			 case WH_LEBEL_TEXT: // Locks for a FLAG character 			 
			 
				  ctrl.ret_mode[TIME_WH] = 0xF052;
				  ctrl.next_mode[TIME_WH] = WH_STYLE_FORMAT;
				  ctrl.exit_mode[TIME_WH] = WH_LEBEL_TEXT;
				  cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Text)+2,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Text_id);
				  ctrl.state[TIME_WH] = WH_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_WH] = g_ulTickCount;		  
				  
			 
			 break;
  
			 case WH_STYLE_FORMAT: // Locks for a FLAG character
			 
				 ctrl.ret_mode[TIME_WH] = 0xF053;
				 ctrl.next_mode[TIME_WH] = WH_END_LEBEL_CMD;
				 ctrl.exit_mode[TIME_WH] = WH_STYLE_FORMAT;
				 
				 cpPutMessage(UART1_BASE,0xF053,0x7,&LabelCmdMsg[OSD_BLACK_WHITE_HOT_ID].Style_id_Color_Size_BackGro_text[0]);
				 ctrl.state[TIME_WH] = WH_WAIT_FOR_MESSAGE_READY;
				 ctrl.time[TIME_WH] = g_ulTickCount;
				 
			 
			 break;
  
			 case WH_END_LEBEL_CMD: // Locks for a FLAG character
			 
				 ctrl.state[TIME_WH] = WH_HIDE_SHOW_LABEL;	  
				 ctrl.time[TIME_WH] = g_ulTickCount;
				 cpReset(1);  
				 SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE); 				 
				 mode = ONLINE_STATE;
			 
			 break;	
			
			  case WH_WAIT_FOR_MESSAGE_READY:
			  
				  if (cpMessageReady(COM1))
				  {
					  n = cpGetMessageCommand(COM1); //tbd
					  if (n==ctrl.ret_mode[TIME_WH])
					  {
						   ctrl.state[TIME_WH] = ctrl.next_mode[TIME_WH]; 							   
						   ctrl.time[TIME_WH] = g_ulTickCount;						   						   
						   cpReset(1);
					  }
					  else
					  {
						  ctrl.state[TIME_WH] = WH_SENT_MESSAGE;							  
						  ctrl.time[TIME_WH] = g_ulTickCount;						  
						  cpReset(1);
						  mode = ONLINE_STATE;
					  }
						
				  } 		 
				  else
				  if ((WORD)(g_ulTickCount - ctrl.time[TIME_WH]) >= (WORD)1000) //-- every 0.5 sec  
				  {
						ctrl.state[TIME_WH] = WH_SENT_MESSAGE;						
						ctrl.time[TIME_WH] = g_ulTickCount;
						cpReset(1);  
						mode = ONLINE_STATE;
						
				  }
			  
			  break;
			
	  		default:

						  ctrl.state[TIME_WH] = WH_SENT_MESSAGE;							  
						  ctrl.time[TIME_WH] = g_ulTickCount;						  
						  cpReset(1);
						  mode = ONLINE_STATE;				
			 break;
	}


	return mode;

}


/*
 * FUNCTION:  Freeze_Unfreeze_Video - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Upload_V_Flip_Enable(WORD mode)
{

	WORD n; 
	
	m_Zoom_Flip.byte2 |= 0x10;

	if (cpMessageReady(COM1))
	{
		n = cpGetMessageCommand(COM1); //tbd
		if (n==0xA020)
			mode = ONLINE_STATE;
	}
	else
		cpPutMessage(UART1_BASE,0xA020,sizeof(m_Zoom_Flip),(unsigned char *)&m_Zoom_Flip);

return mode;



}	

/*
 * FUNCTION:  Freeze_Unfreeze_Video - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Upload_V_Flip_Disable(WORD mode)
{

	WORD n; 
	
	m_Zoom_Flip.byte2 &= 0xEF;

	if (cpMessageReady(COM1))
	{
		n = cpGetMessageCommand(COM1); //tbd
		if (n==0xA020)
			mode = ONLINE_STATE;
	}
	else
		cpPutMessage(UART1_BASE,0xA020,sizeof(m_Zoom_Flip),(unsigned char *)&m_Zoom_Flip);

return mode;



}	





/*
 * FUNCTION:  Freeze_Unfreeze_Video - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Upload_H_Flip_Enable(WORD mode)

{

	WORD n; 
	
	m_Zoom_Flip.byte2 |= 0x01;
	
	if (cpMessageReady(COM1))
	{
		n = cpGetMessageCommand(COM1); //tbd
		if (n==0xA020)
			mode = ONLINE_STATE;
	}
	else
		cpPutMessage(UART1_BASE,0xA020,sizeof(m_Zoom_Flip),(unsigned char *)&m_Zoom_Flip);

return mode;

}	

/*
 * FUNCTION:  Freeze_Unfreeze_Video - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Upload_H_Flip_Disable(WORD mode)

{

	WORD n; 
	
	m_Zoom_Flip.byte2 &= 0xFE;
	
	if (cpMessageReady(COM1))
	{
		n = cpGetMessageCommand(COM1); //tbd
		if (n==0xA020)
			mode = ONLINE_STATE;
	}
	else
		cpPutMessage(UART1_BASE,0xA020,sizeof(m_Zoom_Flip),(unsigned char *)&m_Zoom_Flip);

return mode;

}	


/*
 * FUNCTION:  Freeze_Unfreeze_Video - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Open_Close_Shutter(WORD mode)

{

	WORD n; 

     /*
      * Switch for state of tge message protocol processing
      */
      
      switch (ctrl.state[ACT_4])
      {	

		  case SET_TEMPERATURE:

				  ctrl.ret_mode[ACT_4] = 0xFD06;	  
				  ctrl.next_mode[ACT_4] = READ_SHUTTER_STATUS;
				  ctrl.exit_mode[ACT_4] = SET_TEMPERATURE;
				  ctrl.time[ACT_4] = GetSysTickCount();		  			  
				  ctrl.try[ACT_4] = 0;			  
				  cpPutMessage(UART1_BASE,0xFD06,sizeof(set_temperature),(unsigned char *)&set_temperature);
				  
				  ctrl.state[ACT_4] = WAIT_FOR_MESSAGE;
			  
			  break;

		  
		  case READ_SHUTTER_STATUS:

				  ctrl.ret_mode[ACT_4] = 0xFD05;
				  ctrl.next_mode[ACT_4] = WRITE_SHUTTER_STATUS;				  				  
				  ctrl.exit_mode[ACT_4] = READ_SHUTTER_STATUS;
				  ctrl.time[ACT_4] = GetSysTickCount();		
  				  ctrl.try[ACT_4] = 0;
				  cpPutMessage(UART1_BASE,0xFD05,sizeof(status_shutter),(unsigned char *)&status_shutter);
				  
				  ctrl.state[ACT_4] = WAIT_FOR_MESSAGE;
			  
			  break;


		  case WRITE_SHUTTER_STATUS:

				  if(*(cpGetMessageData(COM1,1)) == 0x01)
				  {
					  ctrl.state[ACT_4] = SET_CLOSE_OPEN_SHUTTER;
					  cpReset(COM1);		   
				  }
				  else
					  ctrl.state[ACT_4] = ctrl.exit_mode[ACT_4];
				  
				  break;

		 case SET_CLOSE_OPEN_SHUTTER:
		 
