EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
				 ctrl.ret_mode[ACT_4] = 0xFD06;	 
				 ctrl.next_mode[ACT_4] = X_WRITE_SHUTTER_STATUS;
				 ctrl.exit_mode[ACT_4] = SET_CLOSE_OPEN_SHUTTER;
				 ctrl.time[ACT_4] = GetSysTickCount(); 						 
				 ctrl.try[ACT_4] = 0;
				 
				 if(ctrl.action == 0 )
					 cpPutMessage(UART1_BASE,0xFD06,sizeof(close_shutter),(unsigned char *)&close_shutter);
				 else
					 cpPutMessage(UART1_BASE,0xFD06,sizeof(open_shutter),(unsigned char *)&open_shutter);
				 
				 ctrl.state[ACT_4] = WAIT_FOR_MESSAGE;
			 
			 break;
		 
		 
		 case X_WRITE_SHUTTER_STATUS: // 4
		 
				 ctrl.ret_mode[ACT_4] = 0xFD05;
				 ctrl.next_mode[ACT_4] = X_READ_SHUTTER_STATUS;
				 ctrl.exit_mode[ACT_4] = X_WRITE_SHUTTER_STATUS;
				 ctrl.time[ACT_4] = GetSysTickCount(); 	   
				 ctrl.try[ACT_4] = 0;
				 cpPutMessage(UART1_BASE,0xFD05,sizeof(status_shutter),(unsigned char *)&status_shutter);
				 
				 ctrl.state[ACT_4] = WAIT_FOR_MESSAGE;
			 
			 break; 			 
		 
		 
		 case X_READ_SHUTTER_STATUS: // 5

			 if(*(cpGetMessageData(COM1,1)) == 0x01)
			 {
				 ctrl.state[ACT_4] = SET_TEMPERATURE;	
				 ctrl.try[ACT_4] = 0;
				 
				 
				 if(GetDMCflag(DMC_ZOOM_X2))
					 mode = UPDATE_ZOOMX2;
				 else				 
				 if(GetDMCflag(DMC_ZOOM_X4))
					 mode = UPDATE_ZOOMX4;
				 else
					 mode = ONLINE_STATE;

				 cpReset(COM1);				 
			 }			
			 else
			 if ((WORD)(GetSysTickCount() - ctrl.time[ACT_4]) >= (WORD)100) //-- every 3 sec	
			 //if(ctrl.try[ACT_4]++ > 5000)
			 {
				 ctrl.time[ACT_4] = GetSysTickCount(); 
				 ctrl.next_mode[ACT_4] = ctrl.exit_mode[ACT_4];
			 }
			
			 break;			 

			 case WAIT_FOR_MESSAGE: // 6
		 
			 if (cpMessageReady(COM1))
			 {
				 n = cpGetMessageCommand(COM1); //tbd
				 if (n==ctrl.ret_mode[ACT_4])
				 {
					  ctrl.state[ACT_4] = ctrl.next_mode[ACT_4];								  
				 }
			 }			
			 else
			 if ((WORD)(GetSysTickCount() - ctrl.time[ACT_4]) >= (WORD)100) //-- every 3 sec
			 {
			 
				   if(ctrl.try[ACT_4]++ > 3)
				   {
					   ctrl.state[ACT_4] = SET_TEMPERATURE;   
					   ctrl.try[ACT_4] = 0;
					   					   
					   mode = ONLINE_STATE;					   
					   cpReset(COM1);					  
				   }
				   //else
					  //ctrl.state[ACT_4] = ctrl.exit_mode[ACT_4]; 					   
			 }
		 
		 break;		 

		 default:
			break;
	  }
				  

return mode;



}	



/*
 * FUNCTION:  Upload_ZoomX4 - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */

WORD RefreshNUCDataCommand(WORD mode)
{

	char data_bock = 0x01;
	WORD n;

	switch (ctrl.state[TIME_NUC])
	{
	
			  case REFRESH_NUC_CMD: // Locks for a FLAG character

			   //ctrl.ret_mode[TIME_NUC] = 0xF202; 		   
			   //ctrl.next_mode[TIME_NUC] = WAIT_FOR_NUC_MESSAGE_READY; 		   
			   //ctrl.exit_mode[TIME_NUC] = REFRESH_NUC_CMD;
			   //ctrl.state[TIME_NUC] = WAIT_FOR_NUC_MESSAGE_READY;
			   
			   cpPutMessage(UART1_BASE,0xF202,1,(unsigned char *)&data_bock);
			   ctrl.state[TIME_NUC] = REFRESH_NUC_CMD;
			   mode = ONLINE_STATE;

			  break;
	

			case WAIT_FOR_NUC_MESSAGE_READY:
			
				if (cpMessageReady(COM1))
				{
					n = cpGetMessageCommand(COM1); //tbd
					if (n==ctrl.ret_mode[TIME_NUC])
					{
						 ctrl.state[TIME_NUC] = REFRESH_NUC_CMD; 
				         mode = ONLINE_STATE;
			   
					}
					else
						ctrl.state[TIME_NUC] = REFRESH_NUC_CMD; 
					  
				}		   
				else
				if ((WORD)(GetSysTickCount() - ctrl.time[TIME_NUC]) >= (WORD)50) //-- every 0.5 sec	 
				{
					  ctrl.time[TIME_NUC] = GetSysTickCount();							 
					  ctrl.state[TIME_NUC] = REFRESH_NUC_CMD; 
				}
			
			break;

	  		default:

			  cpReset(COM1);  
			  mode = ONLINE_STATE;
						  
			 break;
	}
		
	return mode;
}



/*
 * FUNCTION:  Upload_ZoomX4 - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Upload_ZoomX2(WORD mode)
{

	WORD n; 
	
	m_Zoom_Flip.byte1 = 0x01; //  Zoom X2
	
	m_Zoom_Flip.byte2 = 0x11; // H-Flip V-Flip enable	
	m_Zoom_Flip.center_x = 200;
	m_Zoom_Flip.center_y = 180;

	switch (ctrl.state[TIME_ZOOM2])
	{
	
			  case Z2_SENT_MESSAGE: // Locks for a FLAG character

			   ctrl.ret_mode[TIME_ZOOM2] = 0xA020; 		   
			   ctrl.next_mode[TIME_ZOOM2] = Z2_HIDE_SHOW_LABEL; 		   
			   ctrl.exit_mode[TIME_ZOOM2] = Z2_SENT_MESSAGE;
			   ctrl.state[TIME_ZOOM2] = Z2_WAIT_FOR_MESSAGE_READY;

			   LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[1]	   = 27;   // X
			   LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[3]	   = 170;  // Y

			   strcpy(LabelCmdMsg[1].Text,"<<");
			   LabelCmdMsg[1].Text[strlen(LabelCmdMsg[1].Text)] = 0;									   
			   Set_LABEL_Visibility(OSD_ZOOM_ID,1);
			
			   cpPutMessage(UART1_BASE,0xA020,sizeof(m_Zoom_Flip),(unsigned char *)&m_Zoom_Flip);
			   ctrl.time[TIME_ZOOM2] = g_ulTickCount;				   	
			
			  break;
	
			 case Z2_HIDE_SHOW_LABEL: // Locks for a FLAG character

  
				  ctrl.ret_mode[TIME_ZOOM2] = 0xF050;			  
				  ctrl.next_mode[TIME_ZOOM2] = Z2_X_LABEL_POSITION;			  
				  ctrl.exit_mode[TIME_ZOOM2] = Z2_HIDE_SHOW_LABEL;
				  cpPutMessage(UART1_BASE,0xF050,0x2,&LabelCmdMsg[OSD_ZOOM_ID].Label_id_Visibility[0]);			  
				  ctrl.state[TIME_ZOOM2] = Z2_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_ZOOM2] = g_ulTickCount;
  
  
			 break;
  
			 case Z2_X_LABEL_POSITION: // Locks for a FLAG character
			 
				  ctrl.ret_mode[TIME_ZOOM2] = 0xF051;
				  ctrl.next_mode[TIME_ZOOM2] = Z2_LEBEL_TEXT;
				  ctrl.exit_mode[TIME_ZOOM2] = Z2_X_LABEL_POSITION;
				  cpPutMessage(UART1_BASE,0xF051,0x5,&LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[0]);			  
				  ctrl.state[TIME_ZOOM2] = Z2_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_ZOOM2] = g_ulTickCount;
				  
			 
			 break;
  
			 case Z2_LEBEL_TEXT: // Locks for a FLAG character 			 
			 
				  ctrl.ret_mode[TIME_ZOOM2] = 0xF052;
				  ctrl.next_mode[TIME_ZOOM2] = Z2_STYLE_FORMAT;
				  ctrl.exit_mode[TIME_ZOOM2] = Z2_LEBEL_TEXT;
				  cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[OSD_ZOOM_ID].Text)+2,&LabelCmdMsg[OSD_ZOOM_ID].Text_id);
				  ctrl.state[TIME_ZOOM2] = Z2_WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TIME_ZOOM2] = g_ulTickCount;		  
				  
			 
			 break;
  
			 case Z2_STYLE_FORMAT: // Locks for a FLAG character
			 
				 ctrl.ret_mode[TIME_ZOOM2] = 0xF053;
				 ctrl.next_mode[TIME_ZOOM2] = Z2_END_LEBEL_CMD;
				 ctrl.exit_mode[TIME_ZOOM2] = Z2_STYLE_FORMAT;
				 
				 cpPutMessage(UART1_BASE,0xF053,0x7,&LabelCmdMsg[OSD_ZOOM_ID].Style_id_Color_Size_BackGro_text[0]);
				 ctrl.state[TIME_ZOOM2] = Z2_WAIT_FOR_MESSAGE_READY;
				 ctrl.time[TIME_ZOOM2] = g_ulTickCount;
				 
			 
			 break;
  
			 case Z2_END_LEBEL_CMD: // Locks for a FLAG character

				 SetDMCflag(DMC_ZOOM_X2,DMC_ZOOM_X2);	 // signal for control center					 
				 SetDMCflag(DMC_ZOOM_X4,0);
				 SetDMCflag(DMC_DISABLE_ZOOM,0);	 
			 
				 ctrl.state[TIME_ZOOM2] = Z2_SENT_MESSAGE;	  
				 ctrl.time[TIME_ZOOM2] = g_ulTickCount;
				 cpReset(1);  
				 mode = ONLINE_STATE;
			 
			 break;	
			
			  case Z2_WAIT_FOR_MESSAGE_READY:
			  
				  if (cpMessageReady(COM1))
				  {
					  n = cpGetMessageCommand(COM1); //tbd
					  if (n==ctrl.ret_mode[TIME_ZOOM2])	  
					  {					  
						  ctrl.state[TIME_ZOOM2] = ctrl.next_mode[TIME_ZOOM2];				  					  
						  ctrl.try[TIME_ZOOM2] = 0;
						  cpReset(COM1);  
						  ctrl.time[TIME_ZOOM2]   = g_ulTickCount;						  
					  }
					  else
					  {
						  ctrl.state[TIME_ZOOM2] = Z2_SENT_MESSAGE;				  					  
						  ctrl.time[TIME_ZOOM2]   = g_ulTickCount;						  						  
						  ctrl.try[TIME_ZOOM2] = 0;
						  cpReset(COM1);  
						  mode = ONLINE_STATE;
					  }
				  }
				  else
				  if ((WORD)(GetSysTickCount() - ctrl.time[TIME_ZOOM2]) >= (WORD)1000) //-- every 3 sec
				  { 	  
							ctrl.time[TIME_ZOOM2] = g_ulTickCount;
							if(ctrl.try[TIME_ZOOM2]++ > 1)
							{
								ctrl.try[TIME_ZOOM2] = 0;									
							    ctrl.state[TIME_ZOOM2] = Z2_SENT_MESSAGE;							
								mode = ONLINE_STATE;		  
								cpReset(COM1);				   
							}
				  }
				  
				  break;
			
	  		default:

						  ctrl.state[TIME_ZOOM2] = Z2_SENT_MESSAGE;				  					  
						  ctrl.time[TIME_ZOOM2]   = g_ulTickCount;						  						  
						  ctrl.try[TIME_ZOOM2] = 0;
						  cpReset(COM1);  
						  mode = ONLINE_STATE;
						  
			 break;
	}
		

	return mode;
}
	
