EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
/*
 * FUNCTION:  Upload_ZoomX2 - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Upload_ZoomX4(WORD mode)
{
	
		WORD n; 
		m_Zoom_Flip.byte1 = 0x11; //  Zoom X4		
		m_Zoom_Flip.byte2 = 0x11; // H-Flip V-Flip enable		
		m_Zoom_Flip.center_x = 200;
		m_Zoom_Flip.center_y = 160;

		switch (ctrl.state[TIME_ZOOM4])
		{
		
				  case Z4_SENT_MESSAGE: // Locks for a FLAG character

				   ctrl.ret_mode[TIME_ZOOM4] = 0xA020; 		   
				   ctrl.next_mode[TIME_ZOOM4] = Z4_HIDE_SHOW_LABEL; 		   
				   ctrl.exit_mode[TIME_ZOOM4] = Z4_SENT_MESSAGE;
				   ctrl.state[TIME_ZOOM4] = Z4_WAIT_FOR_MESSAGE_READY;
				   

			   	   LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[1]	   = 27;   // X
			   	   LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[3]	   = 240;  // Y
			   
				   strcpy(LabelCmdMsg[1].Text,"<<");
				   LabelCmdMsg[1].Text[strlen(LabelCmdMsg[1].Text)] = 0;									   
				   Set_LABEL_Visibility(OSD_ZOOM_ID,1);
				
				   cpPutMessage(UART1_BASE,0xA020,sizeof(m_Zoom_Flip),(unsigned char *)&m_Zoom_Flip);
				   ctrl.time[TIME_ZOOM4] = g_ulTickCount;				   	
				
				  break;
		
				 case Z4_HIDE_SHOW_LABEL: // Locks for a FLAG character

	  
					  ctrl.ret_mode[TIME_ZOOM4] = 0xF050;			  
					  ctrl.next_mode[TIME_ZOOM4] = Z4_X_LABEL_POSITION;			  
					  ctrl.exit_mode[TIME_ZOOM4] = Z4_HIDE_SHOW_LABEL;
					  cpPutMessage(UART1_BASE,0xF050,0x2,&LabelCmdMsg[OSD_ZOOM_ID].Label_id_Visibility[0]);			  
					  ctrl.state[TIME_ZOOM4] = Z4_WAIT_FOR_MESSAGE_READY;
					  ctrl.time[TIME_ZOOM4] = g_ulTickCount;
	  
	  
				 break;
	  
				 case Z4_X_LABEL_POSITION: // Locks for a FLAG character
				 
					  ctrl.ret_mode[TIME_ZOOM4] = 0xF051;
					  ctrl.next_mode[TIME_ZOOM4] = Z4_LEBEL_TEXT;
					  ctrl.exit_mode[TIME_ZOOM4] = Z4_X_LABEL_POSITION;
					  cpPutMessage(UART1_BASE,0xF051,0x5,&LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[0]);			  
					  ctrl.state[TIME_ZOOM4] = Z4_WAIT_FOR_MESSAGE_READY;
					  ctrl.time[TIME_ZOOM4] = g_ulTickCount;
					  
				 
				 break;
	  
				 case Z4_LEBEL_TEXT: // Locks for a FLAG character 			 
				 
					  ctrl.ret_mode[TIME_ZOOM4] = 0xF052;
					  ctrl.next_mode[TIME_ZOOM4] = Z4_STYLE_FORMAT;
					  ctrl.exit_mode[TIME_ZOOM4] = Z4_LEBEL_TEXT;
					  cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[OSD_ZOOM_ID].Text)+2,&LabelCmdMsg[OSD_ZOOM_ID].Text_id);
					  ctrl.state[TIME_ZOOM4] = Z4_WAIT_FOR_MESSAGE_READY;
					  ctrl.time[TIME_ZOOM4] = g_ulTickCount;		  
					  
				 
				 break;
	  
				 case Z4_STYLE_FORMAT: // Locks for a FLAG character
				 
					 ctrl.ret_mode[TIME_ZOOM4] = 0xF053;
					 ctrl.next_mode[TIME_ZOOM4] = Z4_END_LEBEL_CMD;
					 ctrl.exit_mode[TIME_ZOOM4] = Z4_STYLE_FORMAT;
					 
					 cpPutMessage(UART1_BASE,0xF053,0x7,&LabelCmdMsg[OSD_ZOOM_ID].Style_id_Color_Size_BackGro_text[0]);
					 ctrl.state[TIME_ZOOM4] = Z4_WAIT_FOR_MESSAGE_READY;
					 ctrl.time[TIME_ZOOM4] = g_ulTickCount;
					 
				 
				 break;
	  
				 case Z4_END_LEBEL_CMD: // Locks for a FLAG character

					 SetDMCflag(DMC_ZOOM_X4,DMC_ZOOM_X4);	 // signal for control center
					 SetDMCflag(DMC_ZOOM_X2,0);
					 SetDMCflag(DMC_DISABLE_ZOOM,0);
				 
					 ctrl.state[TIME_ZOOM4] = Z4_SENT_MESSAGE;	  
					 ctrl.time[TIME_ZOOM4] = g_ulTickCount;
					 cpReset(1);  
					 mode = ONLINE_STATE;
				 
				 break;	
				
				  case Z4_WAIT_FOR_MESSAGE_READY:
				  
					  if (cpMessageReady(COM1))
					  {
						  n = cpGetMessageCommand(COM1); //tbd
						  if (n==ctrl.ret_mode[TIME_ZOOM4])	  
						  {					  
							  ctrl.state[TIME_ZOOM4] = ctrl.next_mode[TIME_ZOOM4];				  					  
							  ctrl.try[TIME_ZOOM4] = 0;
							  cpReset(COM1);  
							  ctrl.time[TIME_ZOOM4]   = g_ulTickCount;						  
						  }
						  else
						  {
							  ctrl.state[TIME_ZOOM4] = Z4_SENT_MESSAGE;				  					  
							  ctrl.try[TIME_ZOOM4] = 0;
							  cpReset(COM1);  
							  ctrl.time[TIME_ZOOM4]   = g_ulTickCount;	
							  mode = ONLINE_STATE;
					  	  }
					  }
					  else
					  if ((WORD)(GetSysTickCount() - ctrl.time[TIME_ZOOM4]) >= (WORD)1000) //-- every 3 sec
					  { 	  
								ctrl.time[TIME_ZOOM4] = g_ulTickCount;
								if(ctrl.try[TIME_ZOOM4]++ > 1)
								{
									ctrl.state[TIME_ZOOM4] = Z4_SENT_MESSAGE;								
									ctrl.try[TIME_ZOOM4] = 0;									
									mode = ONLINE_STATE;		  
									cpReset(COM1);			
									mode = ONLINE_STATE;
								}
					  }
					  
					  break;
				
		  		default:

							  ctrl.state[TIME_ZOOM4] = Z4_SENT_MESSAGE;				  					  
							  ctrl.try[TIME_ZOOM4] = 0;
							  cpReset(COM1);  
							  ctrl.time[TIME_ZOOM4]   = g_ulTickCount;	
							  mode = ONLINE_STATE;					
				 break;
		}
		
	return mode;
}

/*
 * FUNCTION:  Upload_ZoomX2 - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Disable_Zoom(WORD mode)
{
	
		WORD n; 
	
		m_Zoom_Flip.byte1 = 0x0; // Disable Zoom		
		m_Zoom_Flip.byte2 = 0x11; // H-Flip V-Flip enable
		m_Zoom_Flip.center_x = 396;
		m_Zoom_Flip.center_y = 288;


		switch (ctrl.state[TIME_DIS])
		{


				  case DIS_SENT_MESSAGE: // Locks for a FLAG character

				   ctrl.ret_mode[TIME_DIS] = 0xA020; 		   
				   ctrl.next_mode[TIME_DIS] = DIS_HIDE_SHOW_LABEL; 		   
				   ctrl.exit_mode[TIME_DIS] = DIS_SENT_MESSAGE;
				   ctrl.state[TIME_DIS] = DIS_WAIT_FOR_MESSAGE_READY;	
				   

			       LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[1]	   = 27;   // X
			   	   LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[3]	   = 100;  // Y

			       strcpy(LabelCmdMsg[1].Text,"<<");
			       LabelCmdMsg[1].Text[strlen(LabelCmdMsg[1].Text)] = 0;									   
			       Set_LABEL_Visibility(OSD_ZOOM_ID,1);
			   
				   cpPutMessage(UART1_BASE,0xA020,0x6,(unsigned char *)&m_Zoom_Flip);
				   ctrl.time[TIME_DIS] = g_ulTickCount;				   	
				
				  break;

		
				 case DIS_HIDE_SHOW_LABEL: // Locks for a FLAG character

	  
					  ctrl.ret_mode[TIME_DIS] = 0xF050;			  
					  ctrl.next_mode[TIME_DIS] = DIS_X_LABEL_POSITION;			  
					  ctrl.exit_mode[TIME_DIS] = DIS_HIDE_SHOW_LABEL;
					  ctrl.state[TIME_DIS] = DIS_WAIT_FOR_MESSAGE_READY;					  
					  cpPutMessage(UART1_BASE,0xF050,0x2,&LabelCmdMsg[OSD_ZOOM_ID].Label_id_Visibility[0]);			  
					  ctrl.time[TIME_DIS] = g_ulTickCount;
	  
	  
				 break;
	  
				 case DIS_X_LABEL_POSITION: // Locks for a FLAG character
				 
					  ctrl.ret_mode[TIME_DIS] = 0xF051;
					  ctrl.next_mode[TIME_DIS] = DIS_LEBEL_TEXT;
					  ctrl.exit_mode[TIME_DIS] = DIS_X_LABEL_POSITION;
					  ctrl.state[TIME_DIS] = DIS_WAIT_FOR_MESSAGE_READY;					  
					  cpPutMessage(UART1_BASE,0xF051,0x5,&LabelCmdMsg[OSD_ZOOM_ID].Position_id_X_Y[0]);			  
					  ctrl.time[TIME_DIS] = g_ulTickCount;
					  
				 
				 break;
	  
				 case DIS_LEBEL_TEXT: // Locks for a FLAG character 			 
				 
					  ctrl.ret_mode[TIME_DIS] = 0xF052;
					  ctrl.next_mode[TIME_DIS] = DIS_STYLE_FORMAT;
					  ctrl.exit_mode[TIME_DIS] = DIS_LEBEL_TEXT;
					  ctrl.state[TIME_DIS] = DIS_WAIT_FOR_MESSAGE_READY;					  
					  cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[OSD_ZOOM_ID].Text)+2,&LabelCmdMsg[OSD_ZOOM_ID].Text_id);
					  ctrl.time[TIME_DIS] = g_ulTickCount;		  
					  
				 
				 break;
	  
				 case DIS_STYLE_FORMAT: // Locks for a FLAG character
				 
