EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
					 ctrl.ret_mode[TIME_DIS] = 0xF053;
					 ctrl.next_mode[TIME_DIS] = DIS_END_LEBEL_CMD;
					 ctrl.exit_mode[TIME_DIS] = DIS_STYLE_FORMAT;
					 ctrl.state[TIME_DIS] = DIS_WAIT_FOR_MESSAGE_READY;					 
					 cpPutMessage(UART1_BASE,0xF053,0x7,&LabelCmdMsg[OSD_ZOOM_ID].Style_id_Color_Size_BackGro_text[0]);
					 ctrl.time[TIME_DIS] = g_ulTickCount;
					 
				 
				 break;
	  
				 case DIS_END_LEBEL_CMD: // Locks for a FLAG character

					 SetDMCflag(DMC_DISABLE_ZOOM,DMC_DISABLE_ZOOM);  // signal for control center				 
					 SetDMCflag(DMC_ZOOM_X2,0);
					 SetDMCflag(DMC_ZOOM_X4,0); 					 
					 ctrl.state[TIME_DIS] = DIS_SENT_MESSAGE;	  
					 ctrl.time[TIME_DIS] = g_ulTickCount;
					 cpReset(1);  
					 mode = ONLINE_STATE;
				 
				 break;	
				
				  case DIS_WAIT_FOR_MESSAGE_READY:
				  
					  if (cpMessageReady(COM1))
					  {
						  n = cpGetMessageCommand(COM1); //tbd
						  if (n==ctrl.ret_mode[TIME_DIS])	  
						  {					  
							  ctrl.state[TIME_DIS] = ctrl.next_mode[TIME_DIS];				  					  
							  ctrl.try[TIME_DIS] = 0;
							  cpReset(COM1);  
							  ctrl.time[TIME_DIS]   = g_ulTickCount;						  
						  }
						  else
						  {
							  ctrl.state[TIME_DIS] = DIS_SENT_MESSAGE;				  					  
							  ctrl.try[TIME_DIS] = 0;
							  cpReset(COM1);  
							  ctrl.time[TIME_DIS]   = g_ulTickCount;
							  mode = ONLINE_STATE;
						  }
					  }
					  else
					  if ((WORD)(GetSysTickCount() - ctrl.time[TIME_DIS]) >= (WORD)1000) //-- every 3 sec
					  { 	  
								ctrl.time[TIME_DIS] = g_ulTickCount;
								if(ctrl.try[TIME_DIS]++ > 1)
								{
									ctrl.state[TIME_DIS] = DIS_SENT_MESSAGE;								
									ctrl.try[TIME_DIS] = 0;									
									mode = ONLINE_STATE;		  
									cpReset(COM1);				   
								}
					  }
					  
					  break;
				
		  		default:
					
					ctrl.state[TIME_DIS] = DIS_SENT_MESSAGE;									
					ctrl.try[TIME_DIS] = 0;
					cpReset(COM1);	
					ctrl.time[TIME_DIS]   = g_ulTickCount;
					mode = ONLINE_STATE;
					
				 break;
		}
			
	return mode;
}

		
/*
 * FUNCTION:  Upload_ZoomX2 - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Upload_Zoom_Position(WORD mode)
{
		
			WORD n; 
			m_Zoom_Flip.byte2 = 0x11; // H-Flip V-Flip enable
		
			if (cpMessageReady(COM1))
			{
				n = cpGetMessageCommand(COM1); //tbd
				if (n==0xA020)
				{
					mode = ONLINE_STATE;
				}
			}
			else
				cpPutMessage(UART1_BASE,0xA020,sizeof(m_Zoom_Flip),(unsigned char *)&m_Zoom_Flip);
		
		return mode;
}

/*
 * FUNCTION:  Freeze_Unfreeze_Video - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Freeze_Unfreeze_Video(WORD mode)
{

	WORD n;	

	if (cpMessageReady(COM1))
	{
		n = cpGetMessageCommand(COM1); //tbd
		if (n==0xA040)
			mode = ONLINE_STATE;
	}
	else
	{
		Freeze_Unfreeze = !Freeze_Unfreeze;
		cpPutMessage(UART1_BASE,0xA040,1,(unsigned char *)&Freeze_Unfreeze);
	}

	return mode;

}	

/*
 * FUNCTION:  Freeze_Unfreeze_Video - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Tec_Read_Handler(WORD mode)
{

	WORD n;	
	WORD   len = 0;	
	unsigned char msg[20];
	double	Case_temp;

	
	if (cpMessageReady(COM1))
	{
		n = cpGetMessageCommand(COM1); //tbd
		if (n==0xF00F)
		{
			len = cpGetMessageDataLen(COM1);
			//memcpy(&m_TEC_Params, cpGetMessageData(COM1,0), len);
			memcpy(&msg,cpGetMessageData(COM1,0),len);


			// Calculate case and substrate values from TEC_Read_Buf
			Case_temp = (double)(((int)(msg[3])<<24) + (((int)(msg[4])) << 16) + (((int)(msg[5] << 8))));
			// Performing arithmetic shift right 8 bit while keeping the sign
			Case_temp /= 256.0;			
			m_TEC_Params.Case_tem = ((((((double)Case_temp)*10)/pow(2.0, 24)) -  0.106)/0.000360) + 25.0;
						  
			mode = ONLINE_STATE;			
			cpReset(COM1);		   
		
		}
	}
	else
	{
		cpPutMessage(UART1_BASE,0xF00F,0,NULL);
	}

	return mode;

}	


/*
 * FUNCTION:  Update_2_P - Main Com Proc message processing loop
 * RETURN: Non-zero of message detected  
 */
WORD Update_2_P(WORD mode)
{
   //char ch;
   //int i = 0;	
   WORD n;
   char status_shutter[9] ={ 0x00, 0xA5, 0x90, 0x20, 0x20, 0x20,0x20, 0x20, 0x68};
   char algorithm[10] = {0,0,6,3,5,4,0,0,0,0};
   char algorithm1[10] = {0,0,2,6,3,5,4,0,0,0};
   
     /*
      * Switch for state of tge message protocol processing
      */
      switch (ctrl.state[UPDATE_2_P])
      {
	 
          case DISABLED_CIC_2_P: // Locks for a FLAG character

				  m_ALG_Params.ALG_CIC = 0;					
				  ctrl.ret_mode[UPDATE_2_P] = 0xF018;
				  ctrl.next_mode[UPDATE_2_P] = DISABLED_ARC_2_P;
				  ctrl.exit_mode[UPDATE_2_P] = DISABLED_CIC_2_P;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();
 				  ctrl.try[UPDATE_2_P] = 0;				
				  //cpPutMessage(UART1_BASE,0xF018,sizeof(ALG_Params),&ALG_Params);
				  cpPutMessage(UART1_BASE,0xF018,sizeof(algorithm),(unsigned char *)&algorithm);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
				
             break;

          case DISABLED_ARC_2_P: // Disabel ARC command

				  m_ARC_Params.Enable = 0x00;
				  ctrl.ret_mode[UPDATE_2_P] = 0xF020;
				  ctrl.next_mode[UPDATE_2_P] = CLOSE_SHUTTER_2_P;
				  ctrl.exit_mode[UPDATE_2_P] = DISABLED_ARC_2_P;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();				
				  ctrl.try[UPDATE_2_P] = 0;				
				  cpPutMessage(UART1_BASE,0xF020,sizeof(m_ARC_Params),(unsigned char *)&m_ARC_Params);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;


             break;

		  case CLOSE_SHUTTER_2_P:

				  ctrl.ret_mode[UPDATE_2_P] = 0xFD06;	  
				  ctrl.next_mode[UPDATE_2_P] = READ_SHUTTER_STATUS_2_P;
				  ctrl.exit_mode[UPDATE_2_P] = CLOSE_SHUTTER_2_P;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();		  			  
				  ctrl.try[UPDATE_2_P] = 0;			  
				  cpPutMessage(UART1_BASE,0xFD06,sizeof(close_shutter),(unsigned char *)&close_shutter);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
			  
			  break;


		  case READ_SHUTTER_STATUS_2_P:

				  ctrl.ret_mode[UPDATE_2_P] = 0xFD05;
				  ctrl.next_mode[UPDATE_2_P] = WRITE_SHUTTER_STATUS_2_P;
				  ctrl.exit_mode[UPDATE_2_P] = READ_SHUTTER_STATUS_2_P;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();		
  				  ctrl.try[UPDATE_2_P] = 0;
				  cpPutMessage(UART1_BASE,0xFD05,sizeof(status_shutter),(unsigned char *)&status_shutter);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
			  
			  break;


		  case WRITE_SHUTTER_STATUS_2_P:

				  if(*(cpGetMessageData(COM1,1)) == 0x01)
					  ctrl.state[UPDATE_2_P] = F_AVG_SET_PARAM;
				  break;


