EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
		  case F_AVG_SET_PARAM:

				  ctrl.ret_mode[UPDATE_2_P] = 0xF019;
				  ctrl.next_mode[UPDATE_2_P] = POLL_COMPILETION_FRAME_AVERAGING;
				  ctrl.exit_mode[UPDATE_2_P] = F_AVG_SET_PARAM;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();						  				    
				  ctrl.try[UPDATE_2_P] = 0;
				  cpPutMessage(UART1_BASE,0xF019,sizeof(m_Frm_Avg_Params),(unsigned char *)&m_Frm_Avg_Params);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
			 
			  break;

			  
		  case POLL_COMPILETION_FRAME_AVERAGING:

				  ctrl.ret_mode[UPDATE_2_P] = 0xF022;
				  ctrl.next_mode[UPDATE_2_P] = COMPLETED_FRAME_AVERAGING;
				  ctrl.exit_mode[UPDATE_2_P] = POLL_COMPILETION_FRAME_AVERAGING;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();						  				    
				  ctrl.try[UPDATE_2_P] = 0;
				  cpPutMessage(UART1_BASE,0xF022,0,NULL);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
				 
			  break;


		  case COMPLETED_FRAME_AVERAGING:


			  if(*(cpGetMessageData(COM1,0)) == 0x00)
				  ctrl.state[UPDATE_2_P] = ENABLED_CIC_2_P;
			  else
				  ctrl.state[UPDATE_2_P] = ctrl.exit_mode[UPDATE_2_P];
			  	
			  break;


          case ENABLED_CIC_2_P: // Locks for a FLAG character

			  	  m_ALG_Params.ALG_CIC = 0x2;
				  
				  ctrl.ret_mode[UPDATE_2_P] = 0xF018;
				  ctrl.next_mode[UPDATE_2_P] = SET_NEW_CIC_REFERENCE;
				  ctrl.exit_mode[UPDATE_2_P] = ENABLED_CIC_2_P;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();
 				  ctrl.try[UPDATE_2_P] = 0;				
				  //cpPutMessage(UART1_BASE,0xF018,sizeof(ALG_Params),&ALG_Params);
				  cpPutMessage(UART1_BASE,0xF018,sizeof(algorithm1),(unsigned char *)&algorithm1);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
				
             break;


		  case SET_NEW_CIC_REFERENCE:

				  m_CIC_Params.Op_Type = 0x01;

				  ctrl.ret_mode[UPDATE_2_P] = 0xF013;
				  ctrl.next_mode[UPDATE_2_P] = SET_NEW_NUC_REFERENCE;
				  ctrl.exit_mode[UPDATE_2_P] = SET_NEW_CIC_REFERENCE;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();
				  ctrl.try[UPDATE_2_P] = 0; 			
				  cpPutMessage(UART1_BASE,0xF013,sizeof(m_CIC_Params),(unsigned char *)&m_CIC_Params);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
				 
			  break;


		  case SET_NEW_NUC_REFERENCE:

				  m_NUC_Params.Op_Type = 0x2;

				  ctrl.ret_mode[UPDATE_2_P] = 0xF014;
				  ctrl.next_mode[UPDATE_2_P] = OPEN_SHUTTER_2_P;
				  ctrl.exit_mode[UPDATE_2_P] = SET_NEW_NUC_REFERENCE;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();
				  ctrl.try[UPDATE_2_P] = 0; 			
				  cpPutMessage(UART1_BASE,0xF014,sizeof(m_NUC_Params),(unsigned char *)&m_NUC_Params);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
				 
			  break;


		  case OPEN_SHUTTER_2_P:

				  ctrl.ret_mode[UPDATE_2_P] = 0xFD06;	  
				  ctrl.next_mode[UPDATE_2_P] = READ_SHUTTER_STATUS_2_P_2;
				  ctrl.exit_mode[UPDATE_2_P] = OPEN_SHUTTER_2_P;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();			  			  
				  ctrl.try[UPDATE_2_P] = 0;			  
				  cpPutMessage(UART1_BASE,0xFD06,sizeof(open_shutter),(unsigned char *)&open_shutter);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
			  
			  break;


		  case READ_SHUTTER_STATUS_2_P_2:

				  ctrl.ret_mode[UPDATE_2_P] = 0xFD05;
				  ctrl.next_mode[UPDATE_2_P] = ENABLED_ARC_2_P;
				  ctrl.exit_mode[UPDATE_2_P] = READ_SHUTTER_STATUS_2_P_2;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();		
  				  ctrl.try[UPDATE_2_P] = 0;
				  cpPutMessage(UART1_BASE,0xFD05,sizeof(status_shutter),(unsigned char *)&status_shutter);
				  
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;
			  
			  break;			  


		  case WRITE_SHUTTER_STATUS_2_P_2:

				  if(*(cpGetMessageData(COM1,1)) == 0x01)
					  ctrl.state[UPDATE_2_P] = ENABLED_ARC_2_P;
				  
			 
			  break;


          case ENABLED_ARC_2_P: // Disabel ARC command

				  m_ARC_Params.Enable = 0x01;
				  ctrl.ret_mode[UPDATE_2_P] = 0xF020;
				  ctrl.next_mode[UPDATE_2_P] = END_UPDATE_2_P;
				  ctrl.exit_mode[UPDATE_2_P] = ENABLED_ARC_2_P;
				  ctrl.time[UPDATE_2_P] = GetSysTickCount();				
				  ctrl.try[UPDATE_2_P] = 0;				
				  cpPutMessage(UART1_BASE,0xF020,sizeof(m_ARC_Params),(unsigned char *)&m_ARC_Params);
				  ctrl.state[UPDATE_2_P] = WAIT_FOR_MESSAGE_READY;


             break;

			  case END_UPDATE_2_P: // Disabel ARC command
			  
					  mode = ONLINE_STATE;
					  ctrl.state[UPDATE_2_P] = DISABLED_CIC_2_P;
					  cpReset(1);
			  		  	
				 break;


			  case WAIT_FOR_MESSAGE_READY:

			  if (cpMessageReady(COM1))
			  {
				  n = cpGetMessageCommand(COM1); //tbd
				  if (n==ctrl.ret_mode[UPDATE_2_P])
				  {
					   ctrl.state[UPDATE_2_P] = ctrl.next_mode[UPDATE_2_P]; 
				  }
				  	
			  }			 
			  else
		  	  if ((WORD)(GetSysTickCount() - ctrl.time[UPDATE_2_P]) >= (WORD)3000) //-- every 3 sec
			  //if(ctrl.try[UPDATE_2_P]++ > 5000)
		  	  {
						cpReset(1);		  	  
						ctrl.state[UPDATE_2_P] = ctrl.exit_mode[UPDATE_2_P]; 
						ctrl.time[UPDATE_2_P] = GetSysTickCount();
		  	  }

		  break;

          default:
             break;
       }
	  
   return mode;
}

  /*
   * FUNCTION:	Set_Label_Position 
   * RETURN: Non-zero of message detected  
   */
  WORD Set_Text_Label_Command(WORD mode)
  {
  
	  //WORD	 id = 0;  
	  WORD n; 

		  /*
		   * Switch for state of tge message protocol processing
		   */
		   switch (ctrl.state[TEXT_LABEL])
		   {
		  
			 case HIDE_SHOW_LABEL: // Locks for a FLAG character
  
				  ctrl.ret_mode[TEXT_LABEL] = 0xF050;			  
				  ctrl.next_mode[TEXT_LABEL] = X_LABEL_POSITION;			  
				  ctrl.exit_mode[TEXT_LABEL] = HIDE_SHOW_LABEL;
				  ctrl.time[TEXT_LABEL] = g_ulTickCount;
				  cpPutMessage(UART1_BASE,0xF050,0x2,&LabelCmdMsg[OSD_MODE_ID].Label_id_Visibility[0]);			  
				  ctrl.state[TEXT_LABEL] = WAIT_FOR_MESSAGE_READY;
  
  
			 break;
  
			 case X_LABEL_POSITION: // Locks for a FLAG character
			 
				  ctrl.ret_mode[TEXT_LABEL] = 0xF051;
				  ctrl.next_mode[TEXT_LABEL] = LEBEL_TEXT;
				  ctrl.exit_mode[TEXT_LABEL] = X_LABEL_POSITION;
				  cpPutMessage(UART1_BASE,0xF051,0x5,&LabelCmdMsg[OSD_MODE_ID].Position_id_X_Y[0]);			  
				  ctrl.state[TEXT_LABEL] = WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TEXT_LABEL] = g_ulTickCount;
				  
			 
			 break;
  
			 case LEBEL_TEXT: // Locks for a FLAG character 			 
			 
				  ctrl.ret_mode[TEXT_LABEL] = 0xF052;
				  ctrl.next_mode[TEXT_LABEL] = STYLE_FORMAT;
				  ctrl.exit_mode[TEXT_LABEL] = LEBEL_TEXT;
				  cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[OSD_MODE_ID].Text)+2,&LabelCmdMsg[OSD_MODE_ID].Text_id);
				  ctrl.state[TEXT_LABEL] = WAIT_FOR_MESSAGE_READY;
				  ctrl.time[TEXT_LABEL] = g_ulTickCount;		  
				  
			 
			 break;
  
