EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/comproc.c
			 case STYLE_FORMAT: // Locks for a FLAG character
			 
				 ctrl.ret_mode[TEXT_LABEL] = 0xF053;
				 ctrl.next_mode[TEXT_LABEL] = END_LEBEL_CMD;
				 ctrl.exit_mode[TEXT_LABEL] = STYLE_FORMAT;
				 
				 cpPutMessage(UART1_BASE,0xF053,0x7,&LabelCmdMsg[OSD_MODE_ID].Style_id_Color_Size_BackGro_text[0]);
				 ctrl.state[TEXT_LABEL] = WAIT_FOR_MESSAGE_READY;
				 ctrl.time[TEXT_LABEL] = g_ulTickCount;
				 
			 
			 break;
  
			 case END_LEBEL_CMD: // Locks for a FLAG character
			 
				 ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL;	  
				 ctrl.time[TEXT_LABEL] = g_ulTickCount;
				 cpReset(1);  
				 SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);  
				 mode = ONLINE_STATE;
			 
			 break;
  
			 case WAIT_FOR_MESSAGE_READY:
			 
				 if (cpMessageReady(COM1))
				 {
					 n = cpGetMessageCommand(COM1); //tbd
					 if (n==ctrl.ret_mode[TEXT_LABEL])
					 {
						  ctrl.state[TEXT_LABEL] = ctrl.next_mode[TEXT_LABEL]; 
						  ctrl.time[TEXT_LABEL] = g_ulTickCount;
						  cpReset(1);
					 }
					 else
					 {
						 ctrl.state[TEXT_LABEL] = END_LEBEL_CMD; 
						 cpReset(1);	
						 ctrl.time[TEXT_LABEL] = g_ulTickCount;
						 mode = ONLINE_STATE;
					 }
					   
				 }			
				 else
				 if ((WORD)(g_ulTickCount - ctrl.time[TEXT_LABEL]) >= (WORD)1000) //-- every 0.5 sec  
				 {
					   ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL;	
					   ctrl.time[TEXT_LABEL] = g_ulTickCount;
					   cpReset(1);	
					   mode = ONLINE_STATE;
					   
				 }
			 
			 break;
		  
			 default:
			 	
				 ctrl.state[TEXT_LABEL] = END_LEBEL_CMD; 
				 cpReset(1);	
				 ctrl.time[TEXT_LABEL] = g_ulTickCount;
				 mode = ONLINE_STATE;

				break;
		   }
		   	  		  
	  return mode;
  
}   

 
  /*
  * FUNCTION:  Set_Label_Position 
  * RETURN: Non-zero of message detected  
  */
 void Put_Text_Label(BYTE id,BYTE Visib)
 {
 
	 WORD n; 
	 int endofloop=1;
		 
	 while(endofloop != 0)
	 {
		 /*
		  * Switch for state of tge message protocol processing
		  */
		  switch (ctrl.state[TEXT_LABEL1])
		  {
		 
 
			case LEBEL_TEXT: // Locks for a FLAG character				
			
				 ctrl.ret_mode[TEXT_LABEL1] = 0xF052;
				 ctrl.next_mode[TEXT_LABEL1] = END_LEBEL_CMD;
				 ctrl.exit_mode[TEXT_LABEL1] = LEBEL_TEXT;
				 cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[id].Text)+2,&LabelCmdMsg[id].Text_id);
				 ctrl.state[TEXT_LABEL1] = WAIT_FOR_MESSAGE_READY;
				 ctrl.time[TEXT_LABEL1] = GetSysTickCount();		 
				 
			
			break;
 
			case END_LEBEL_CMD: // Locks for a FLAG character
			
				ctrl.state[TEXT_LABEL1] = HIDE_SHOW_LABEL;	 
				ctrl.time[TEXT_LABEL1] = GetSysTickCount();
				cpReset(1);  
				ctrl.try[TEXT_LABEL1] = 0;
				endofloop = 0;
			
			break;
 
			case WAIT_FOR_MESSAGE_READY:
			
				if (cpMessageReady(COM1))
				{
					n = cpGetMessageCommand(COM1); //tbd
					if (n==ctrl.ret_mode[TEXT_LABEL1])
						 ctrl.state[TEXT_LABEL1] = ctrl.next_mode[TEXT_LABEL1]; 
					else
						ctrl.state[TEXT_LABEL1] = END_LEBEL_CMD; 
					  
				}		   
				else
				if ((WORD)(GetSysTickCount() - ctrl.time[TEXT_LABEL1]) >= (WORD)50) //-- every 0.5 sec	 
				{
					  ctrl.time[TEXT_LABEL1] = GetSysTickCount();							 
					  ctrl.state[TEXT_LABEL1] = END_LEBEL_CMD; 
				}
			
			break;
		 
			default:
				endofloop = 0;
			   break;
		  }
		 }
	 
 }	 


 /*
 * FUNCTION:  Set_Label_Position 
 * RETURN: Non-zero of message detected  
 */
int Set_Text_Label(BYTE id,BYTE Visib)
{

	WORD n;	
	int endofloop=1;
		
	while(endofloop != 0)
	{
		/*
		 * Switch for state of tge message protocol processing
		 */
		 switch (ctrl.state[TEXT_LABEL1])
		 {
		
		   case HIDE_SHOW_LABEL: // Locks for a FLAG character

				ctrl.ret_mode[TEXT_LABEL1] = 0xF050;				
				ctrl.next_mode[TEXT_LABEL1] = X_LABEL_POSITION;				
				ctrl.exit_mode[TEXT_LABEL1] = HIDE_SHOW_LABEL;
				ctrl.time[TEXT_LABEL1] = GetSysTickCount();
				cpPutMessage(UART1_BASE,0xF050,0x2,&LabelCmdMsg[id].Label_id_Visibility[0]);			
				ctrl.state[TEXT_LABEL1] = WAIT_FOR_MESSAGE_READY;


		   break;

		   case X_LABEL_POSITION: // Locks for a FLAG character
		   
		   		ctrl.ret_mode[TEXT_LABEL1] = 0xF051;
				ctrl.next_mode[TEXT_LABEL1] = LEBEL_TEXT;
				ctrl.exit_mode[TEXT_LABEL1] = X_LABEL_POSITION;
				cpPutMessage(UART1_BASE,0xF051,0x5,&LabelCmdMsg[id].Position_id_X_Y[0]);			
				ctrl.state[TEXT_LABEL1] = WAIT_FOR_MESSAGE_READY;
				ctrl.time[TEXT_LABEL1] = GetSysTickCount();
				
		   
		   break;

		   case LEBEL_TEXT: // Locks for a FLAG character	  		   
		   
		   		ctrl.ret_mode[TEXT_LABEL1] = 0xF052;
				ctrl.next_mode[TEXT_LABEL1] = STYLE_FORMAT;
				ctrl.exit_mode[TEXT_LABEL1] = LEBEL_TEXT;
				cpPutMessage(UART1_BASE,0xF052,strlen(LabelCmdMsg[id].Text)+2,&LabelCmdMsg[id].Text_id);
				ctrl.state[TEXT_LABEL1] = WAIT_FOR_MESSAGE_READY;
				ctrl.time[TEXT_LABEL1] = GetSysTickCount();			
				
		   
		   break;

		   case STYLE_FORMAT: // Locks for a FLAG character
		   
			   ctrl.ret_mode[TEXT_LABEL1] = 0xF053;
			   ctrl.next_mode[TEXT_LABEL1] = END_LEBEL_CMD;
			   ctrl.exit_mode[TEXT_LABEL1] = STYLE_FORMAT;
			   
			   cpPutMessage(UART1_BASE,0xF053,0x7,&LabelCmdMsg[id].Style_id_Color_Size_BackGro_text[0]);
			   ctrl.state[TEXT_LABEL1] = WAIT_FOR_MESSAGE_READY;
			   ctrl.time[TEXT_LABEL1] = GetSysTickCount();
			   
		   
		   break;

		   case END_LEBEL_CMD: // Locks for a FLAG character
		   
			   ctrl.state[TEXT_LABEL1] = HIDE_SHOW_LABEL;	
			   ctrl.time[TEXT_LABEL1] = GetSysTickCount();
			   cpReset(1);	
			   ctrl.try[TEXT_LABEL1] = 0;
			   endofloop = 0;
			   return 1;
		   
		   break;

		   case WAIT_FOR_MESSAGE_READY:
		   
			   if (cpMessageReady(COM1))
			   {
				   n = cpGetMessageCommand(COM1); //tbd
				   if (n==ctrl.ret_mode[TEXT_LABEL1])
						ctrl.state[TEXT_LABEL1] = ctrl.next_mode[TEXT_LABEL1]; 
				   else
					   ctrl.state[TEXT_LABEL1] = END_LEBEL_CMD; 
					 
			   }		  
			   else
			   if ((WORD)(GetSysTickCount() - ctrl.time[TEXT_LABEL1]) >= (WORD)50) //-- every 0.5 sec	
			   {
				   ctrl.state[TEXT_LABEL1] = HIDE_SHOW_LABEL;	
				   ctrl.time[TEXT_LABEL1] = GetSysTickCount();
				   cpReset(1);	
				   ctrl.try[TEXT_LABEL1] = 0;
				   endofloop = 0; 
				   return 0;
			   }
		   
		   break;
		
		   default:
			  break;
		 }
		}
	
}	
 
void Set_LABEL_Visibility(BYTE idx,int Visib)
{
	LabelCmdMsg[idx].Label_id_Visibility[1]	=Visib;		
}


WORD On_Off_Stabilize(WORD mode)
{
	
	cpPutMessage(UART1_BASE,0xF032,1,&Stabilize_status);
	
	return ONLINE_STATE;

}

